<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.61 [en] (X11; I; Linux 2.2.13-7mdk i686) [Netscape]">
   <title>chart_manual</title>
</head>
<body bgcolor="#FFFFFF">

<h1>
1.&nbsp;<a NAME="Introduction"></a>Introduction</h1>
<i>Chart</i> est un outil graphique de visualisation de donn&eacute;es
au format BIMG bas&eacute; sur la librairie de fonctions NCAR Graphics.
Il permet de repr&eacute;senter l'information sous forme de dessin couleur,
d'isocontours et/ou de vecteurs et poss&egrave;de quelques options de texte.
Il supporte aussi la plupart des projections de NCAR Graphics et peut superposer
une carte g&eacute;ographique aux donn&eacute;es.
<p><i>Chart</i> est divis&eacute; en plusieurs blocs, ind&eacute;pendants
les uns des autres et poss&eacute;dant chacun leur entr&eacute;e de donn&eacute;es.
Actuellement, il existe trois blocs qui traitent les couleurs, les isocontours
et les vecteurs. Il existe aussi deux autres blocs qui s'occupent de la
carte et du texte. Il est &agrave; noter que la configuration de la carte
influence tous les blocs, &eacute;tant donn&eacute; que la projection choisie
d&eacute;terminera le trac&eacute; des donn&eacute;es. Chaque bloc produit
une partie de dessin qui sera assembl&eacute;e aux autres pour cr&eacute;er
le dessin final.
<p>Chaque entr&eacute;e peut accepter un fichier de donn&eacute;es, un
fichier masque et un fichier grille. Comme chaque bloc est ind&eacute;pendant,
des donn&eacute;es de masque et de grilles diff&eacute;rentes peuvent &ecirc;tre
sp&eacute;cifi&eacute;es &agrave; chaque entr&eacute;e. Les seules restrictions
sont qu'une zone commune doit &ecirc;tre couverte par l'ensemble des fichiers
de donn&eacute;es et que les fichiers de grille et de masque doivent avoir
la m&ecirc;me taille que les fichiers de donn&eacute;es auxquels ils s'appliquent.
R&eacute;f&eacute;rez-vous &agrave; la <a href="#Formats">section 9</a>
pour plus de d&eacute;tails sur le format des fichiers.
<p>Les fichiers de donn&eacute;es et les options sont fournis sur la ligne
de commande lors de l'appel de <i>chart</i>, ou peuvent se trouver dans
un fichier de configuration. Les options relatives aux couleurs d&eacute;butent
toutes par <b>clr</b>, aux contours par <b>cnt</b> et aux vecteurs par
<b>vec</b>.
Par exemple, pour un trac&eacute; couleur des donn&eacute;es du fichier
topex.bimg, on taperait la ligne de commande suivante :
<pre>&nbsp;chart -clrdata topex.bimg</pre>
Pour tracer uniquement la r&eacute;gion situ&eacute;e entre -82&deg;E et
-62&deg;E de longitude et 20&deg;N et 40&deg;N de latitude, avec la bathym&eacute;trie
en couleur et les isocontours de topex.bimg, on taperait la ligne de commande
suivante:
<pre>&nbsp; chart -clrdata bathy.bimg -cntdata topex.bimg -zoom -82 -62 20 40</pre>
Cet exemple illustre la division de <i>chart</i> en blocs:
<br><img SRC="exemple_p2.JPG" height=662 width=740>
<br>&nbsp;
<p>Voici un bref aper&ccedil;u des diff&eacute;rentes possibilit&eacute;s
de chart :
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=40 WIDTH="100%" >
<tr>
<td VALIGN=TOP WIDTH="20%">Couleur :&nbsp;</td>

<td VALIGN=TOP>par d&eacute;faut, <i>chart</i> utilise une palette de couleur
interne, qui d&eacute;finit la couleur des mers, des continents, etc. Il
est possible de d&eacute;finir sa propre palette et de la fournir &agrave;
<i>chart</i>.
Voir la <a href="#Couleurs">section 4</a> &agrave; ce sujet.&nbsp;
<br>Pour colorer les donn&eacute;es, <i>chart</i> calcule des limites qui
serviront &agrave; d&eacute;terminer la couleur de chaque point selon sa
valeur. Il existe deux m&eacute;thodes de calcul des limites (lin&eacute;aire
et &eacute;galis&eacute;e) et il est aussi possible d'imposer les limites
&agrave; l'aide d'un fichier. (voir <a href="#Couleurs">section 4</a>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>Isocontours :&nbsp;</td>

<td VALIGN=TOP>Des isocontours sont automatiquement trac&eacute;s d&egrave;s
que des donn&eacute;es sont fournies au bloc. Il est possible de choisir
le nombre d'isocontours trac&eacute;s, l'intervalle qui les s&eacute;pare,
ainsi que leur valeur. Plusieurs autres options sont disponibles pour modifier
les line labels ainsi que le texte d'information. (voir <a href="#Isocontours">section
5</a>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>Vecteurs :</td>

<td><i>Chart</i> produit un trac&eacute; de vecteurs d&egrave;s que des
donn&eacute;es vectorielles sont fournies. Il est possible de sous-&eacute;chantilloner
un champ. Plusieurs autres options permettent de modifier l'apparence des
vecteurs (longueur, couleur). Les vecteurs peuvent &ecirc;tre color&eacute;s
selon leur module, ou selon le champ de donn&eacute;es du bloc couleur.
(voir <a href="#Vecteurs">section 6</a>)&nbsp;</td>
</tr>
</table>

<br>&nbsp;
<table BORDER=0 CELLSPACING=40 WIDTH="100%" >
<tr>
<td VALIGN=TOP WIDTH="20%">Cartes :&nbsp;</td>

<td VALIGN=TOP><i>Chart</i> trace automatiquement une carte sur les donn&eacute;es.
Il est possible de ne pas tracer les continents, ou de ne tracer que leur
contour. Plusieurs types de projection sont possibles. D'autres options
permettent de contr&ocirc;ler le trac&eacute; des m&eacute;ridiens, de
ne tracer qu'une partie des donn&eacute;es, etc. (voir <a href="#Configuration">section
3</a>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>Texte :&nbsp;</td>

<td VALIGN=TOP>10 cha&icirc;nes de caract&egrave;res peuvent &ecirc;tre
ajout&eacute;es au dessin. Il est possible de s&eacute;lectionner la taille
des caract&egrave;res ainsi que leur police. <i>Chart</i> suppose aussi
la plupart des options de PLOTCHAR (module de NCAR Graphics).&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>Ajouts en surimpression</td>

<td>Possiblit&eacute; d'ajouter des trac&eacute;s de lignes ou de marqueurs
en surimpression sur une carte</td>
</tr>
</table>

<p>Les sections suivantes d&eacute;crivent en d&eacute;tail les options
associ&eacute;es &agrave; chaque bloc, ainsi que les diff&eacute;rents
formats de fichiers.
<br>&nbsp;
<h1>
2.0&nbsp;<a NAME="Options générales"></a>Options g&eacute;n&eacute;rales</h1>
Cette section d&eacute;crit les quelques options qui s'appliquent &agrave;
l'ensemble du dessin et non &agrave; un seul bloc.
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=40 >
<tr>
<td VALIGN=TOP NOWRAP WIDTH="15%"><a NAME="-p"></a><b>-p</b><i> fichier</i></td>

<td>Indique la palette de couleurs &agrave; lire. Par d&eacute;faut, <i>chart</i>
cr&eacute;e une palette de 14 couleurs, et d&eacute;finit la couleur des
oc&eacute;ans, des continents et des valeurs sp&eacute;ciales. <font color="#000000">Voir
la <a href="#Palette de couleurs">section 9.1</a></font> pour en savoir
plus sur les fichiers de palette.</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-o"></a>-<b>o</b> <i>fichier</i></td>

<td>S&eacute;lectionne le nom du fichier de m&eacute;tacode &agrave; cr&eacute;er.
Par d&eacute;faut, <i>chart</i> cr&eacute;e un fichier nomm&eacute; gmeta.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-rev"></a>-<b>rev</b></td>

<td>Inverse les couleurs de background et de foreground. Utile surtout
pour obtenir un fond blanc pour imprimer sans avoir &agrave; modifier la
palette de couleurs.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-lev"></a>-<b>lev</b> <i>integer</i></td>

<td>S&eacute;lectionne la (les) couche(s) &agrave; dessiner. Il est possible
de sp&eacute;cifier plusieurs couches &agrave; la fois, auquel cas un fichier
est cr&eacute;&eacute; avec plusieurs frames.&nbsp;
<br>Une virgule (,) s&eacute;pare les couches &eacute;num&eacute;r&eacute;es
une &agrave; une, et un tiret (-) indique une s&eacute;rie de couches.
Par exemple, pour dessiner les couches 1, 3, 5, 7, 8, 9, 10 :&nbsp;
<br>&nbsp;&nbsp; <i>-</i><b>lev</b><i> 1,3,5,7-10</i>
<br>0 indique &agrave; <i>chart</i> de dessiner toutes les couches.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><b>-dep</b> <i>real</i>
<br><i>-</i><b>ndep</b><i> real</i></td>

<td>Permet de sp&eacute;cifier une profondeur en unit&eacute; de profondeur
du fichier bimg (en g&eacute;n\ral m&egrave;tres), au lieu d'un niveau
(option -<b>lev</b>). L'option -<b>ndep</b> permet de dessiner le niveau
le plus proche (nearest depth) de la profondeur demand&eacute;e. L'option
-<b>dep</b> est pr&eacute;vue pour provoquer une interpolation pour avoir
les champs exactement &agrave; la profondeur demand&eacute;e. Les chaines
CLR_DEPTH etc... sont mises &agrave; jour.</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-time"></a>-<b>time</b> <i>integer</i></td>

<td>S&eacute;lectionne le (les) pas de temps &agrave; dessiner. Il est
possible de sp&eacute;cifier plusieurs pas de temps &agrave; la fois, auquel
cas un seul fichier est cr&eacute;&eacute; avec plusieurs frames. Pour
obtenir plusieurs pas de temps, utilisez la m&ecirc;me syntaxe que pour
-<b>lev</b>.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-mask"></a>-<b>mask</b> <i>fichier</i></td>

<td>Permet de masquer une partie des donn&eacute;es. Les points de grille
masqu&eacute;s sont remplac&eacute;s par une valeur sp&eacute;ciale et
ne sont pas pris en compte lors des calculs. Cette option sp&eacute;cifie
le masque pour toutes les entr&eacute;es de donn&eacute;es et correspond
aux options <a href="#-clrmask">-<b>clrmask</b></a>, <a href="#-cntmask">-<b>cntmask</b></a>
et <a href="#-vecmask">-<b>vecmask</b></a>. Le <a href="#Masque">fichier
mask</a> travaille avec un masque de 1 sur terre et 0 sur mer.</td>
</tr>

<tr>
<td>-<b>maskopa</b> <i>fichier mask opa</i></td>

<td>Idem &agrave; l'option mask mais travaille avec un masque de type OPA,
<i>ie
</i>avec 0 sur terre et 1 sur mer. L'option -<b>mask</b>, originale dans
<i>chart</i> travaille avec un masque de 1 sur terre et 0 sur mer.</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-grid"></a>-<b>grid </b><i>fichier</i></td>

<td>Permet de traiter des donn&eacute;es dont la grille est irr&eacute;guli&egrave;re.
Cette option sp&eacute;cifie la grille pour toutes les entr&eacute;es de
donn&eacute;es et correspond aux options <a href="#-clrgrid">-<b>clrgrid</b></a>,
<a href="#-cntgrid">-<b>cntgrid</b></a>
et <a href="#-vecgrid">-<b>vecgrid</b></a>.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-gridxy"></a>-<b>gridxy</b> <i>fichier</i></td>

<td>Permet de sp&eacute;cifier un fichier grille dans lequel, la latidude
et la longitude des points sont des fonctions de (i,j). Cette option est
une g&eacute;n&eacute;ralisation importante de l'option -<b>grid</b>. Elle
peut d'ailleurs &ecirc;tre utilis&eacute;e syst&eacute;matiquement en remplacement
de -<b>grid</b>. Quand on l'utilise, les couleurs sont trait&eacute;es
par les routines de contourage, et non plus par les "color cell array"
(option -<b>clriso</b> activ&eacute;e par d&eacute;faut).</td>
</tr>

<tr>
<td>-<b>Cgrid</b></td>

<td VALIGN=TOP>Nouvelle option pour pouvoir tracer des vecteurs &agrave;
partir des fichiers U et V sur la grille C, avec indexage OPA. Prochainement,
la version pour SPEM ... (qui pose probl&egrave;me &agrave; cause des dimensions
diff&eacute;rentes entre U et V). Cette option peut s'utiliser&nbsp; avec
-<b>vecdatax</b> et -<b>vecdatay</b> ou bien avec <a href="#-vecdataxy">-<b>vecdataxy</b></a>.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>showgrid </b><i>fichier</i></td>

<td>Permet de visualiser une grille en overlay sur une carte. Pour l'instant
tous les points sont pris, il faut donc souvent zoomer. Attention, cette
grille n'est absolument pas utilis&eacute;e pour projeter les donn&eacute;es.
Elle est seulement visualis&eacute;e sur un fond de carte.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>direct</b></td>

<td>Permet d'utiliser des fichiers de donn&eacute;es (<b><a href="#-clrdata">clrdata</a></b>
ou <b><a href="#-cntdata">cntdata</a></b>) de type &agrave; acc&egrave;s
direct, comme ceux produits par le T3E dans le projet CLIPPER. Dans ce
cas, l'enregistrement num&eacute;ro 1 du fichier contient dans l'ordre:
comment1, ni, nj, nk, nt, ndim, x1, y1, dx, dy, spval, (h(k),k=1,nk),(t(k),k=1,nt).</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>system</b> <i>"command string"</i></td>

<td>Fait un appel system depuis la ligne de commande de <i>chart</i>.&nbsp;
<br>Passe la commande d&egrave;s la lecture de l'option. On peut donc mettre
autant de -<b>system</b> qu'on le d&eacute;sire. Si un fichier r&eacute;sultant
de la commande doit &ecirc;tre utilis&eacute; dans des options -<b>clrdata</b>,
-<b>cntdata</b> etc, penser &agrave; mettre l'option -<b>system</b> <u>avant</u>
l'option -<b>clrdata</b> ....&nbsp;
<br>Cette option permet de faire des pr&eacute;traitements de fichiers,
par exemple.</td>
</tr>
</table>

<h1>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3.0&nbsp;<a NAME="Configuration"></a>Configuration
de la carte</h1>
&nbsp;
<p>&nbsp;
<p><font size=+0>Au d&eacute;part, <i>chart</i> a &eacute;t&eacute; d&eacute;velopp&eacute;
pour visualiser des donn&eacute;es cartographiques, c'est pourquoi une
carte est trac&eacute;e par d&eacute;faut avec les donn&eacute;es. La section
suivante d&eacute;crit comment configurer une carte. Si vos donn&eacute;es
ne sont pas cartographiques, l'option qui vous int&eacute;resse est <b>-noproj</b>,
d&eacute;crite ci-dessous.</font>
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=40 >
<tr>
<td VALIGN=TOP WIDTH="20%"><a NAME="-proj"></a><b>-proj CC</b></td>

<td>S&eacute;lectionne la projection. <i>Chart</i> supporte plusieurs projections
de NCAR Graphics.&nbsp;
<br>CC peut prendre les valeurs suivantes (voir le document de Contouring
and Mapping Tutorial, page 85) :&nbsp;
<br>&nbsp;&nbsp; GL - globe entier&nbsp;
<br>&nbsp;&nbsp; ST - stereographic&nbsp;
<br>&nbsp;&nbsp; OR - orthographic&nbsp;
<br>&nbsp;&nbsp; LE - lambert equal-area&nbsp;
<br>&nbsp;&nbsp; GN - gnomonic&nbsp;
<br>&nbsp;&nbsp; AE - azimuthal equidistant&nbsp;
<br>&nbsp;&nbsp; SV - satellite view&nbsp;
<br>&nbsp;&nbsp; ME - mercator&nbsp;
<br>&nbsp;&nbsp; CE - cylindrical equidistant (d&eacute;faut)&nbsp;
<br>&nbsp;&nbsp; MO - mollweide type&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-noproj"></a>-<b>noproj</b></td>

<td>Cette option d&eacute;sactive toutes les options relatives aux cartes
(projections, trac&eacute; des continents, etc...). Utile lorsque les donn&eacute;es
ne sont pas cartographiques.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-zoom"></a>-<b>zoom</b></td>

<td>Indique la r&eacute;gion des donn&eacute;es &agrave; dessiner. Cette
r&eacute;gion doit &ecirc;tre commune &agrave; tous les fichiers donn&eacute;s
en argument. Par d&eacute;faut, la r&eacute;gion maximale est dessin&eacute;e.&nbsp;
<br>&nbsp;Syntaxe : -<b>zoom</b> xmin xmax ymin ymax&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-marg"></a>-<b>marg</b></td>

<td>Indique la r&eacute;gion &agrave; repr&eacute;senter sur le dessin.
Cette r&eacute;gion peut &ecirc;tre plus grande ou plus petite que celle
d&eacute;crite par -<b>zoom</b>, selon l'effet d&eacute;sir&eacute;.&nbsp;
<br>&nbsp;Syntaxe : -<b>marg</b> xmin xmax ymin ymax&nbsp;
<p><i>note</i> : <i>-<b>marg</b> ne devrait &ecirc;tre utilis&eacute; que
pour modifier l'apparence de la carte, et non pour visualiser une partie
des donn&eacute;es, &eacute;tant donn&eacute; que les calculs sont effectu&eacute;s
sur les donn&eacute;es sp&eacute;cifi&eacute;es par -<b>zoom</b>. Si vous
n'utilisez que -<b>marg</b>, les calculs se font par d&eacute;faut sur
l'ensemble des donn&eacute;es, m&ecirc;me si une partie seulement en est
affich&eacute;e.&nbsp;</i></td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-map"></a>-<b>map</b> / -<b>nomap</b></td>

<td>Dessine ou non les continents sur la carte. Les continents sont remplis
avec la palette d&eacute;finie &agrave; l'index 2. (d&eacute;faut -<b>map</b>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-outl"></a>-<b>outl</b></td>

<td>trac&eacute; du contour des continents seulement</td>
</tr>
</table>

<table BORDER=0 CELLSPACING=40 >
<tr>
<td VALIGN=TOP>-<b>perim</b> / -<b>noperim</b></td>

<td>Dessine ou non un cadre autour de la carte. (d&eacute;faut -<b>perim</b>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>grad / -nograd</b></td>

<td>Dessine ou non une graduation sur le cadre. (d&eacute;faut -<b>grad</b>)&nbsp;
<br>&nbsp;<i>note : -noperim enl&egrave;ve automatiquement la graduation.</i></td>
</tr>

<tr>
<td VALIGN=TOP>-<b>noxlab</b></td>

<td>Pas de labels sur l'axe des x. (longitude)</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>noylab</b></td>

<td>Pas de labels sur l'axe des y. (latitude)</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>xyplot</b></td>

<td>D&eacute;termine l'emplacement de la carte sur le plot frame NCAR.
Les coordon&eacute;es doivent se trouver entre 0.0 et 1.0.&nbsp;
<br>&nbsp;Syntaxe : -<b>xyplot</b> xmin xmax ymin ymax&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-xstep"></a>-<b>xstep</b> int:subd:larg&nbsp;
<p>/&nbsp;
<p><a NAME="-ystep"></a>-<b>ystep</b> int:subd:larg</td>

<td>D&eacute;termine l'intervalle des graduations sur l'axe horizontal
ou vertical. Il est possible de sp&eacute;cifier des subdivisions, ainsi
que la largeur du trait des divisions principales. (utile pour l'option
grille)&nbsp;
<br>&nbsp;Syntaxe : -<b>xstep</b> int:subd:larg&nbsp;
<br>&nbsp;o&ugrave; :&nbsp;
<dl>
<dd>
int - intervalle&nbsp;</dd>

<dd>
subd - nombre de subdivisions&nbsp;</dd>

<dd>
larg - largeur du trait des divisions principales&nbsp;</dd>
</dl>
&nbsp;par exemple, pour obtenir une division tous les deux degr&eacute;s
et une subdivision aux degr&eacute;s :&nbsp;
<br>&nbsp;&nbsp; -<b>xstep</b> 2:2&nbsp;
<br>&nbsp;pour obtenir une subdivision tous les demi-degr&eacute;s, et
un trait deux fois plus large que les divisions principales :&nbsp;
<br>&nbsp;&nbsp; -<b>xstep</b> 2:4:2&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>cslab ??</b></td>

<td>D&eacute;termine la tailles des caract&egrave;res des labels sur les
axes</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>xgrid/-ygrid</b></td>

<td>S&eacute;lectionne le trac&eacute; des lignes horizontales ou verticales
sur le dessin. L'intervalle employ&eacute; est celui sp&eacute;cifi&eacute;
par <a href="#-xstep">-<b>xstep</b></a> ou <a href="#-ystep">-<b>ystep</b></a>,
incluant les subdivisions.&nbsp;
<br>&nbsp;<i>note : lorsque la projection s&eacute;lectionn&eacute;e n'est
pas CE, les m&eacute;ridiens sont trac&eacute;s &agrave; l'aide de la fonction
MAPGRM, qui ne supporte pas un intervalle diff&eacute;rent en x et y. Donc,
d&egrave;s que la projection est autre que CE, -<b>xstep</b> et -<b>ystep</b>
sp&eacute;cifient l'intervalle et la grille pour les x et les y.&nbsp;</i>
<p>&nbsp;exemple : <b>chart</b> -<b>clrdata</b> topex.bimg -<b>proj</b>
GL -<b>rlat</b> 40 -<b>rlon</b> 20 -<b>xgrid</b></td>
</tr>

<tr>
<td VALIGN=TOP>-<b>rlat/-rlon</b></td>

<td>D&eacute;termine le centre de la carte. Par d&eacute;faut, le centre
de la carte correspond au centre des donn&eacute;es.&nbsp;</td>
</tr>
</table>

<p>Exemples:
<center><img SRC="exemple1_p6.JPG" height=368 width=372 align=TEXTTOP>
<br>chart -clrdata topex.bimg -proj OR -xstep 2 -xgrid -zoom -80 -60 20
40
<br><img SRC="exemple2_p6.jpg" height=365 width=369 align=TEXTTOP>
<br>chart -clrdata topex.bimg -proj OR -xstep 2 -xgrid -zoom -80 -60 20
40 -marg -90 -50 10 50
<p><img SRC="exemple3_p6.JPG" height=368 width=374 align=TEXTTOP>
<br>chart -clrdata topex.bimg -proj OR -xstep 2 -xgrid -zoom -80 -60 20
40 -marg -75 -60 20 40
<p><img SRC="exemple_p8.JPG" height=372 width=374 align=CENTER>
<br>chart -clrdata topex.bimg -prog GL -rlat 40 -rlon -20 -xgrid</center>

<h1>
4.0&nbsp;<a NAME="Couleurs"></a>Couleurs</h1>
&nbsp;
<p>&nbsp;
<p>Toutes les options se rapportant &agrave; la couleur commence par le
pr&eacute;fixe <b>clr</b>.
<br>Pour ceux qui connaissent d&eacute;j&agrave; <i>chart</i>, le nom des
anciennes options correspondantes est indiqu&eacute; &agrave; la section
11.2 et peut toujours &ecirc;tre employ&eacute;, mais il est recommand&eacute;
d'utiliser la nouvelle syntaxe.
<p>Si aucune palette de couleurs n'est sp&eacute;cifi&eacute;e, <i>chart</i>
utilisera une palette interne, d&eacute;finissant le fond blanc, le texte
et les lignes noires, ainsi que les continents marron.
<br>Selon le nombre de couleurs, 80 au maximum, <i>chart</i> calcule des
limites, qui sont les valeurs min et max entre lesquelles une certaine
couleur est attribu&eacute;e &agrave; une donn&eacute;e. Les limites peuvent
&ecirc;tre calcul&eacute;es selon deux m&eacute;thodes ou &ecirc;tre lues
dans un fichier. (voir les options <a href="#-clrmet">-<b>clrmet</b></a>
et <a href="#-clrlim">-<b>clrlim</b></a>)
<br>&nbsp;
<br>&nbsp;
<h2>
<font size=+2>4.1 Fichiers</font></h2>

<table BORDER=0 CELLSPACING=40 WIDTH="100%" >
<tr>
<td VALIGN=TOP WIDTH="20%"><a NAME="-clrdata"></a>-<b>clrdata</b> <i>fichier</i></td>

<td>Sp&eacute;cifie le fichier de donn&eacute;es &agrave; colorer.&nbsp;
<br>Indication sur l'&eacute;cran (std output) du minimum et du maximum
du champ &agrave; tracer. Si le champ est constant, passe automatiquement
en <a href="#-clrmet">-<b>clrmet</b> 1</a>.</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-clrmask"></a>-<b>clrmask</b> <i>fichier</i></td>

<td>Permet de remplacer une partie des donn&eacute;es. Les points de grille
masqu&eacute;s sont remplac&eacute;s par une valeur sp&eacute;ciale et
ne sont pris pas en compte lors des calculs. (voir aussi <a href="#-mask">-<b>mask</b></a>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-clrgrid"></a>-<b>clrgrid</b> <i>fichier</i></td>

<td>Permet de traiter des donn&eacute;es dont la grille est irr&eacute;guli&egrave;re.
Le fichier de grille contient coordonn&eacute;es de chaque point sp&eacute;cifi&eacute;
par -<b>clrdata</b>. (voir aussi <a href="#-grid">-<b>grid</b></a>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-clrlim"></a>-<b>clrlim</b> <i>fichier</i></td>

<td>Les limites seront lues dans ce fichier au lieu d'&ecirc;tre calcul&eacute;es.
Le fichier de limites doit d&eacute;finir au minimum le nombre de couleurs
dans la <a href="#Palette de couleurs">palette</a> plus 1. Si plus de limites
sont d&eacute;finies, elles ne seront pas utilis&eacute;es.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-clrlout"></a>-<b>clrlout</b> <i>fichier</i></td>

<td>Lorsque les limites sont calcul&eacute;es par <i>chart</i>, cette option
permet de les r&eacute;cup&eacute;rer dans un fichier. Attention, cette
option &eacute;crasera le fichier donn&eacute; en argument s'il existe
d&eacute;j&agrave;.&nbsp;</td>
</tr>
</table>

<h2>
&nbsp;<font size=+2>4.2&nbsp;<a NAME="Options de calcul"></a><b>Options
de calcul</b></font></h2>

<p>&nbsp;
<center><table BORDER=0 CELLSPACING=20 WIDTH="100%" >
<tr>
<td VALIGN=TOP WIDTH="20%"><a NAME="-clrmet"></a>-<b>clrmet</b> [1 ou 2
]</td>

<td>Deux m&eacute;thodes de calcul des limites sont disponibles.&nbsp;
<br>&nbsp;M&eacute;thode 1 : <i>chart</i> trouve les valeurs minimale et
maximale du champ de donn&eacute;es et divise la plage de valeurs par le
nombre de couleurs (m&eacute;thodes lin&eacute;aire).&nbsp;
<br>&nbsp;M&eacute;thode 2 : <i>chart</i> proc&egrave;de par &eacute;galisation
; de fa&ccedil;on &agrave; attribuer une quantit&eacute; &eacute;gale de
points de grille &agrave; chaque couleur (m&eacute;thode &eacute;galis&eacute;e).&nbsp;
<p>&nbsp;Il est aussi possible de forcer les limites &agrave; certaines
valeurs au moyen d'un fichier. (voir aussi l'option -<b>clrlim</b>)&nbsp;</td>
</tr>
</table></center>

<br>&nbsp;
<br>&nbsp;
<center><table BORDER=0 CELLSPACING=40 WIDTH="100%" >
<tr>
<td VALIGN=TOP>-<b>clrint</b> -<b>clrnoint</b></td>

<td>Comme la distance entre deux points de grille peut devenir importante
lors d'un zoom, chaque point est alors repr&eacute;sent&eacute; par un
carr&eacute; large de plusieurs pixels. L'option -<b>clrint</b> indique
&agrave; <i>chart</i> de calculer les pixels entre les points par interpolation.
Le r&eacute;sultat sera alors plus lisse.&nbsp;
<p>-<b>clrint</b> est l'option utilis&eacute;e par d&eacute;faut. Utilisez
-<b>clrnoint</b> pour avoir une repr&eacute;sentation exacte de vos donn&eacute;es.&nbsp;
<br><img SRC="exemple_p10.JPG" height=386 width=690></td>
</tr>

<tr>
<td VALIGN=TOP>-<b>clrexp</b> <i>real</i></td>

<td>Lorsque des donn&eacute;es sont d'un ordre de grandeur &eacute;lev&eacute;
ou tr&egrave;s petit, cela peut causer des probl&egrave;mes d'espace sous
la barre de palette. -<b>clrexp</b> utilise une puissance de dix par laquelle
<i>chart</i>
divisera les nombres avant de les afficher. Un format appropri&eacute;
peut alors &ecirc;tre utilis&eacute; (voir l'option <a href="#-format">-<b>format</b></a>,
section 7.2) et l'&eacute;chelle peut &ecirc;tre indiqu&eacute;e sous la
barre de palette au moyen de l'option <a href="#-string">-<b>string</b></a>
(section 7.2). Par exemple :&nbsp;
<br><img SRC="exemple2_p10.JPG" height=90 width=445>
<br>&nbsp;pourrait &ecirc;tre modifi&eacute; avec les options :-<b>clrexp</b><i>3</i>
-<b>format</b> <i>PALETTE f10.2</i> -<b>string</b> <i>0.95 0.6 1 1 "x10|S|3"</i>
<br><img SRC="exemple3_p10.JPG" height=138 width=431></td>
</tr>

<tr>
<td VALIGN=TOP>-<b>clrmin</b> <i>real</i>
<p>-<b>clrmax</b> <i>real</i></td>

<td>Valeurs minimale et maximale entre lesquelles on d&eacute;sire que
le calcul des limites s'effectue. Les autres valeurs satureront aux couleurs
extr&ecirc;mes de la palette. Il est possible de ne pr&eacute;ciser que
-<b>clrmin</b> ou -<b>clrmax</b>.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>clrmsk</b></td>

<td>Permet de masquer les valeurs en dehors des limites sp&eacute;cifi&eacute;es
par <i>clrmin</i> et <i>clrmax</i>. Les valeurs inf&eacute;rieures &agrave;
<i>clrmin</i>
sont de la couleur <i>clrmin</i> et les valeurs sup&eacute;rieures &agrave;
<i>clrmax</i> sont de la couleur de <i>clrmax</i>.</td>
</tr>
</table></center>

<h2>
&nbsp; 4.3&nbsp;<a NAME="Autres options"></a><b>Autres options</b></h2>

<table BORDER=0 CELLSPACING=40 WIDTH="100%" >
<tr>
<td VALIGN=TOP WIDTH="20%">-<b>clriso</b></td>

<td>La couleur est normalement produite en colorant chaque pixel de la
carte. Cette m&eacute;thode est rapide lors des calculs, mais a comme inconv&eacute;nient
de cr&eacute;er d'&eacute;normes fichiers postscript &agrave; l'impression.
L'option -<b>clriso</b> indique &agrave; <i>chart</i> de proc&eacute;der
par remplissage d'isocontours. Le temps de calcul est multipli&eacute;
par quatre ou cinq, mais le r&eacute;sultat est plus lisse et le postscript
cr&eacute;&eacute; peut &ecirc;tre jusqu'&agrave; 30 fois plus petit.&nbsp;
<p><i>note : cette option cr&eacute;e parfois des r&eacute;sultats "bizarres"
si elle est utilis&eacute;e avec une projection CE (cylindrique &eacute;quidistante).
Il s'agit d'un bug NCAR incontournable.&nbsp;</i></td>
</tr>

<tr>
<td>-<b>clrlev </b><i>integer</i></td>

<td>Permet de sp&eacute;cifier les niveaux du fichier sp&eacute;cifi&eacute;
par -<b>clrdata</b> &agrave; plotter</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-clrdatamod"></a>-<b>clrdatamod</b></td>

<td>Cette option est une alternative &agrave; <a href="#-clrdata">-<b>clrdata</b></a>.
Les donn&eacute;es pour la couleur proviendront d'un module des vecteurs
plut&ocirc;t que d'un fichier de donn&eacute;es. Il faut, bien entendu,
que des donn&eacute;es soient sp&eacute;fici&eacute;es avec l'option <a href="#-vecdataxy">-<b>vecdata</b></a>.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>clrpal</b> / -<b>clrnopal</b></td>

<td>Affiche ou non une barre de palette. (-<b>clrpal</b> est l'option par
d&eacute;faut)</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>clrxypal</b></td>

<td>D&eacute;termine le rectangle dans lequel sera dessin&eacute;e la barre
de <a href="#Palette de couleurs">palette</a>. Le cadre est donn&eacute;
en coordonn&eacute;es "plot frame", entre 0.0 et 1.0.&nbsp;
<br>&nbsp;Syntaxe : -<b>clrxypal</b> <i>xmin xmax ymin ymax&nbsp;</i></td>
</tr>

<tr>
<td VALIGN=TOP>-<b>clrnocol</b></td>

<td>Cette option emp&ecirc;che le trac&eacute; des donn&eacute;es color&eacute;es.&nbsp;
<br>&nbsp;Surtout utilis&eacute;e en interne par <i>chart</i> pour la coloration
des vecteurs (<a href="#Coloration des vecteurs">section 6.2</a>) et pour
les fichiers de configuration (<a href="#Fichier de configuration">section
8.2</a>).&nbsp;
<br>&nbsp;Par exemple, si les vecteurs sont color&eacute;s selon un scalaire
donn&eacute; par -<b>clrdata</b>, il peut &ecirc;tre utile de ne pas tracer
le scalaire en question.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>clrdim </b><i>integer</i></td>

<td>Lorsque le fichier de donn&eacute;es comporte plus d'une dimension,
cette option sp&eacute;cifie la dimension &agrave; dessiner. Voir la <font color="#000000"><a href="#Format bimg">section
8.3</a> </font>sur le format BIMG. -<b>clrdim</b> s&eacute;lectionne une
dimension parmi ndim.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>vertpal</b></td>

<td>Permet de tracer une palette de couleur dans le sens vertical au lieu
du sens horizontal (par d&eacute;faut). Dans ce cas les valeurs par d&eacute;faut
de <b>xyplot</b> et de <b>xypal</b> sont modifi&eacute;es automatiquement
pour &eacute;viter les chevauchements entre palette et dessin.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>lbpal</b> <i>integer</i></td>

<td>Permet de sp&eacute;cifier la position des labels dans les palettes,
verticales ou horizontales&nbsp;
<dl>
<dd>
0 : pas de labels</dd>

<dd>
1 : labels en dessous ou &agrave; droite (d&eacute;faut)</dd>

<dd>
2 : labels au dessus ou &agrave; gauche</dd>

<dd>
3 : des deux cot&eacute;s</dd>
</dl>
</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>greyscale</b></td>

<td>Utilise une palette interne de 11 niveaux de gris au lieu de la palette
par d&eacute;faut &agrave; 14 couleurs.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>jetpal</b></td>

<td>Permet le choix d'une palette de couleur de type JET avec un nombre
de couleurs sp&eacute;cifi&eacute;, sans passer par un fichier palette.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>zebre</b> <i>integer</i></td>

<td>Permet le choix d'une palette de couleur de type JET mais avec alternance
de bandes noires.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>ocean</b></td>

<td>Permet de colorer les oc&eacute;ans avec la couleur 4 de la palette.
Par d&eacute;faut cette action est d&eacute;activ&eacute;e.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>palout</b></td>

<td>Cette option permet de sortir le fichier palette (au bon format) correspondant
&agrave; la palette utilis&eacute;e. Utile avec l'option -<b>jetpal</b>
puisqu'elle permet de retoucher manuellement une palette. Le fichier de
sortie est en standard le fichier <i>used_palette</i>.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>prev</b></td>

<td>Palette reverse, renverse les couleurs d'une palette, aussi bien par
d&eacute;faut que lue dans un fichier.</td>
</tr>
</table>

<h1>
5.0&nbsp;<a NAME="Isocontours"></a>Isocontours</h1>
Toutes les options se rapportant aux isocontours commencent par le pr&eacute;fixe
<b>cnt</b>.
<p>Par d&eacute;faut <i>chart</i> dessine automatiquement des isocontours
d&egrave;s que les donn&eacute;es sont entr&eacute;es avec -<b>cntdata</b>.
Le nombre d'isocontours et leurs valeurs sont choisis par NCAR pour donner
un beau r&eacute;sultat (nice value). Il est possible, avec les options
d&eacute;crites dans cette section, de modifier ces valeurs par d&eacute;faut
pour obtenir exactement les isocontours d&eacute;sir&eacute;s.
<br>&nbsp;
<h2>
5.1 Fichiers</h2>

<table BORDER=0 CELLSPACING=40 >
<tr>
<td VALIGN=TOP WIDTH="20%"><a NAME="-cntdata"></a>-<b>cntdata</b> <i>fichier</i></td>

<td>Sp&eacute;cifie le fichier de donn&eacute;es.&nbsp;
<br>Modification de la lecture dans le cas o&ugrave; la <i>spval</i> est
nulle. Dans ncarg3.2, <i>spval=0</i> indique que l'on n'utilise pas les
<i>spval</i>.
Il y avait donc probl&egrave;me, corrig&eacute; en rempla&ccedil;ant dans
ce cas les 0 par une <i>spval</i> par d&eacute;faut.</td>
</tr>

<tr>
<td VALIGN=TOP>-<a NAME="-cntmask"></a><b>cntmask</b> <i>fichier</i></td>

<td>Permet de masquer une partie des donn&eacute;es. Les points de grille
masqu&eacute;s sont remplac&eacute;s par une valeur sp&eacute;ciale et
ne sont pas pris en compte lors des calculs. (voir aussi l'option <a href="#-mask">-<b>mask</b></a>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<a NAME="-cntgrid"></a><b>cntgrid</b> <i>fichier</i></td>

<td>Permet de traiter des donn&eacute;es dont la grille est irr&eacute;guli&egrave;re.
Le fichier de grille contient les coordonn&eacute;es de chaque point du
fichier sp&eacute;cifi&eacute; par -<b>cntdata</b>. (voir aussi l'option
<a href="#-grid">-<b>grid</b></a>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-cntlim"></a>-<b>cntlim</b> fichier&nbsp;</td>

<td>La valeur exacte de chaque isocontour est lue dans ce fichier. Le nombre
d'isocontours d&eacute;pend du nombre de valeurs de ce fichier.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<a NAME="-cntlout"></a><b>cntlout</b> fichier&nbsp;</td>

<td>Lorsque les isocontours sont calcul&eacute;s par <i>chart</i>, cette
option permet de les r&eacute;cup&eacute;rer dans un fichier. Attention,
cette option &eacute;crasera le fichier donn&eacute; en argument s'il existe
d&eacute;j&agrave;.&nbsp;</td>
</tr>
</table>

<h2>
5.2 Modification des isocontours</h2>

<table BORDER=0 CELLSPACING=40 >
<tr>
<td VALIGN=TOP WIDTH="20%">-<b>cntnum</b> <i>integer</i></td>

<td>D&eacute;termine le nombre d'isocontours. NCAR calculera l'intervalle
n&eacute;cessaires pour obtenir N isocontours entre les valeurs maximale
et minimale contenue dans les donn&eacute;es.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<a NAME="-cntint"></a><b>cntint</b> <i>real</i></td>

<td>D&eacute;termine l'intervalle entre les isocontours. Les isocontours
seront trac&eacute;s &agrave; partir de la valeur minimale trouv&eacute;e
dans les donn&eacute;es.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>cntmin</b> <i>real</i></td>

<td>valeur minimale &agrave; consid&eacute;rer lors des calculs d'isocontours&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>cntmax</b> <i>real</i></td>

<td>valeur maximale &agrave; consid&eacute;rer lors des calculs d'isocontours</td>
</tr>
</table>

<h2>
5.3 Line Labels</h2>
<i>Note : La plupart des options suivantes ne sont, en fait, qu'un acc&egrave;s
direct &agrave; certaines constantes de NCAR Graphics. Veuillez vous r&eacute;f&eacute;rez
au document &laquo;contouring adn Mapping Tutorial &raquo; pp. 393 &agrave;
416 pour plus de d&eacute;tails. Lorsqu'une option correspond directement
&agrave; une constante NCAR, le nom de la constante est indiqu&eacute;e.</i>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=40 >
<tr>
<td VALIGN=TOP WIDTH="20%">-<a NAME="-cntlbc"></a><b>cntlbc</b> <i>integer</i></td>

<td>Label Box Color index (LBC).&nbsp;
<br>D&eacute;termine l'index de couleur des bo&icirc;tes entourant les
line labels.</td>
</tr>

<tr>
<td VALIGN=TOP>-<a NAME="-cntllb"></a><b>cntllb</b> <i>integer</i></td>

<td>Line Label Box flag (LLB). Valide pour LLB &eacute;gal &agrave; 2 ou
3.&nbsp;
<br>&nbsp;D&eacute;termine le type de cadre autour des line labels.&nbsp;
<dl>
<dd>
&nbsp;0 - aucun cadre&nbsp;</dd>

<dd>
&nbsp;1 - seul un p&eacute;rim&egrave;tre est dessin&eacute; autour des
labels. (m&ecirc;me couleur que le texte)&nbsp;</dd>

<dd>
&nbsp;2 - une bo&icirc;te de couleur (index LBC) est dessin&eacute;e autour
des labels.&nbsp;</dd>

<dd>
&nbsp;3 - 1 et 2, soit une bo&icirc;te de couleur avec un cadre.&nbsp;</dd>
</dl>
</td>
</tr>

<tr>
<td VALIGN=TOP>-<a NAME="-cntllp"></a><b>cntllp</b> <i>integer</i></td>

<td>Line Label Positioning (LLP).&nbsp;
<br>D&eacute;termine si oui ou non des line labels seront dessin&eacute;s
et de quel type.&nbsp;
<p>0 =aucun label,&nbsp;
<p>2 = d&eacute;faut&nbsp;
<br>&nbsp;
<p>(voir page 406 du document &laquo; Contouring and Mapping Tutorial &raquo;
pour plus de d&eacute;tails).&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<a NAME="-cntlw"></a><b>cntlw</b> <i>real</i></td>

<td>Largeur du trait des isocontours. Deux points, suivis d'une valeur,
indiquent la largeur du trait des isocontours &eacute;tiquet&eacute;s.
D&eacute;faut 1.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<a NAME="-cntlabc"></a><b>cntlabc</b> <i>integer</i></td>

<td>D&eacute;termine l'index de couleur du texte des line labels. (une
couleur sp&eacute;ciale dont l'index est entre 10 et 19 peut &ecirc;tre
utilis&eacute;e, voir <a href="#Palette de couleurs">section 9.1</a>)&nbsp;</td>
</tr>
</table>

<h2>
5.4&nbsp;<a NAME="Texte"></a>Texte d'information</h2>
&nbsp;Le texte d'information est la cha&icirc;ne de caract&egrave;res qui
indique habituellement les valeurs des isocontours minimum et maximum,
ainsi que l'intervalle entre les isocontours. Cette cha&icirc;ne peut &ecirc;tre
modifi&eacute;e et plusieurs variables peuvent &ecirc;tre utilis&eacute;es.
Voir &agrave; ce sujet la page 404 du document &laquo; Contouring and Mapping
Tutorial &raquo;.
<center><table BORDER=0 CELLSPACING=40 WIDTH="100%" >
<tr>
<td VALIGN=TOP WIDTH="30%">-<b>cntilb</b> <i>integer</i></td>

<td>Information Label Box flag. (ILB)&nbsp;
<br>Choisit le type de cadre autour du texte d'information&nbsp;
<dl>
<dd>
0 - aucun cadre&nbsp;</dd>

<dd>
1 - seul un p&eacute;rim&egrave;tre est dessin&eacute; autour du texte.
(m&ecirc;me couleur que le texte.)&nbsp;</dd>

<dd>
2 - une bo&icirc;te de couleur (index LBC) est dessin&eacute;e autour du
texte.&nbsp;</dd>

<dd>
3 - 1 et 2, soit une bo&icirc;te de couleur avec un cadre.&nbsp;</dd>
</dl>
</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>cntilc</b> <i>integer</i></td>

<td>Index Label Color (ILC)&nbsp;
<br>Index de la couleur du texte d'information. (Une couleur sp&eacute;ciale
dont l'index est entre 10 et 19 peut &ecirc;tre utilis&eacute;e, voir <a href="#Palette de couleurs">section
8.1</a>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>cntilxy</b> <i>real</i> <i>real</i></td>

<td>Coordonn&eacute;es en X et Y du texte d'information, exprim&eacute;es
en unit&eacute; &laquo; plot frame &raquo; entre 0.0 et 1.0.&nbsp;
<br>Voir <b>-cntilp</b> ci-dessous pour savoir &agrave; quel point du texte
correspondent ces coordonn&eacute;es.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>cntilp</b> <i>integer</i></td>

<td>Information Label Positionning flag. (ILP)&nbsp;
<br>D&eacute;termine le point d&eacute;crit par les coordonn&eacute;es
de <b>-cntilxy</b>. (d&eacute;faut 4)&nbsp;
<p><img SRC="cntilp.jpg" height=120 width=246></td>
</tr>

<tr>
<td VALIGN=TOP>-<b>cntilt</b> <i>string</i></td>

<td>Information Label Text (ILT)&nbsp;
<br>Cha&icirc;ne du texte d'information. Plusieurs variables peuvent &ecirc;tre
utilis&eacute;es dans cette cha&icirc;ne, r&eacute;f&eacute;rez-vous &agrave;
la page 404 du document &laquo; Contouring and Mapping Tutorial &raquo;.&nbsp;
<br>&nbsp;d&eacute;faut : Contours de $CMN$ a $CMX$ par intervalles de
$CIU$&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>cntils</b> <i>real</i></td>

<td>Permet de sp&eacute;cifier la taille des caract&egrave;res utilis&eacute;s
dans le texte d'information des labels. La valeur par d&eacute;faut est
de 0.012.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>cntlls</b> <i>real</i></td>

<td>Permet de sp&eacute;cifier la taille des caract&egrave;res utilis&eacute;s
dans les labels d'isocontours. La valeur par d&eacute;faut est de 0.010.</td>
</tr>
</table></center>

<h2>
5.5 Autres options</h2>

<table BORDER=0 CELLSPACING=40 >
<tr>
<td VALIGN=TOP WIDTH="30%"><i>-</i><b>cntdash</b></td>

<td><font size=+0>Force les lignes de contour n&eacute;gatives &agrave;
&ecirc;tre en tirets.</font></td>
</tr>

<tr>
<td>-<b>cntshade</b></td>

<td>Grise les contours n&eacute;gatifs d'un contourage. Cette option peut
s'appliquer avec ou sans -<b>cntdash</b>, qu'elle compl&egrave;te.</td>
</tr>

<tr>
<td>-<b>cntlev </b><i>integer</i></td>

<td>Permet de sp&eacute;cifier les niveaux du fichier sp&eacute;cifi&eacute;
par <a href="#-cntdata">-<b>cntdata</b></a> &agrave; tracer.</td>
</tr>

<tr>
<td><b>-cntexp</b><i> real</i></td>

<td><font size=+0>Lorsque les donn&eacute;es sont d'un ordre de grandeur
&eacute;lev&eacute; ou tr&egrave;s petit, cela peut causer des probl&egrave;mes
d'affichage des <i>labels </i><b>-cntexp </b>est une puissance de dix par
laquelle <i>chart</i> divisera les nombres avant de les afficher. Un format
appropri&eacute; peut &ecirc;tre alors utilis&eacute;. (voir l'option <b><a href="#-format">-format</a></b>)</font></td>
</tr>

<tr>
<td VALIGN=TOP><b>-cntcwm</b> <i>real</i></td>

<td>Character Width Multiplier (CWM)&nbsp;
<br><font size=+0>Multiplie la taille des caract&egrave;res associ&eacute;s
aux isocontours. Affecte les <i>line labels</i> ainsi que le texte d'information.</font></td>
</tr>

<tr>
<td VALIGN=TOP><b>-cntdim</b></td>

<td>Lorsque le fichier de donn&eacute;es comporte plus d'une dimension,
cette option sp&eacute;cifie la dimension &agrave; dessiner. Voir la <a href="#Format bimg">section
9.3</a> sur le format BIMG.&nbsp;
<p><b>-cntdim</b> s&eacute;lectionne une dimension parmi <b>ndim</b>.</td>
</tr>

<tr>
<td VALIGN=TOP><b>-cntrc1</b> <i>real</i></td>

<td>Regular Scheme Constant 1 (RC1).&nbsp;
<p><font size=+0>Sp&eacute;cifie la distance entre le d&eacute;but d'un
isocontour et le premier label sur cet isocontour lorsque le mode de positionnement
des labels est 2 (LLP).&nbsp; R&eacute;duire cette valeur, ainsi que RC2,
augmente la quantit&eacute; de labels sur le dessin. (d&eacute;faut <i>chart</i>
0.15, d&eacute;faut NCAR 0.25)</font></td>
</tr>

<tr>
<td VALIGN=TOP><b>-cntrc2</b> <i>real</i></td>

<td>Regular Scheme Constant 2 (RC2)&nbsp;

<p class="MsoBodyTextIndent"><font size=+0>Sp&eacute;cifie la distance
entre les labels sur un m&ecirc;me isocontour. Le positionnement et la
quantit&eacute; de labels sur un dessin sont grandement affect&eacute;s
par RC1 et RC2 lorsque LLP est 2. (d&eacute;faut <i>chart </i>0.15, d&eacute;faut
NCAR 0.25)</font></td>
</tr>
</table>
&nbsp; <i><font size=+0>Rappel :&nbsp; la couleur des isocontours est d&eacute;termin&eacute;e
par l'index 5 de la <a href="#Palette de couleurs">palette de couleur</a>.
Si cette couleur n'est pas sp&eacute;cifi&eacute;e dans la palette, les
contours seront de la couleur du foreground.</font></i>
<h1>
6.0&nbsp;<a NAME="Vecteurs"></a>Vecteurs</h1>
Par d&eacute;faut, <i>chart</i> trace des vecteurs d&egrave;s que des donn&eacute;es
sont sp&eacute;cifi&eacute;es avec l'une des options <b>-vecdataXX</b>.
Comme les vecteurs comportent plusieurs composantes, l'entr&eacute;e de
donn&eacute;es peut s'effectuer de plusieurs fa&ccedil;ons. On peut sp&eacute;cifier
les donn&eacute;es dimension par dimension, auquel cas chaque fichier bimg
contient une composante, ou bien on peut d&eacute;finir le bimg comme contenant
plusieurs dimensions.
<br>&nbsp;
<h2>
<b>6.1 Fichiers</b></h2>

<table BORDER=0 CELLSPACING=40 WIDTH="100%" >
<tr>
<td VALIGN=TOP>-<b>vecdatax</b> <i>fichier</i> -<b>vecdatay </b><i>fichier</i></td>

<td>D&eacute;finissent les composantes X et Y des vecteurs &agrave; tracer.
La Ni&egrave;me couche au temps t (d&eacute;finie par <b><a href="#-lev">-lev</a></b>
et <b><a href="#-time">-time</a></b>) de chaque fichier est lue et les
composantes sont assembl&eacute;es pour former les vecteurs.</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-vecdataxy"></a>-<b>vecdataxy </b><i>fichier</i></td>

<td>les composantes X et Y sont lues d'un m&ecirc;me fichier. A la Ni&egrave;me
couche et au temps t (d&eacute;finis par <b><a href="#-lev">-lev</a></b>
et <b><a href="#-time">-time</a></b>), les dimensions 1 et 2 sont assembl&eacute;es
pour former les vecteurs.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>vecdatapsi</b> <i>fichier</i></td>

<td>Le fichier sp&eacute;cifi&eacute; contient des donn&eacute;es de fonction
de courant desquelles seront d&eacute;riv&eacute;s les vecteurs.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-vecmask"></a>-<b>vecmask</b> <i>fichier</i></td>

<td>Permet de masquer une partie des donn&eacute;es. Les points de grille
masqu&eacute;s sont remplac&eacute;s par une valeur sp&eacute;ciale et
ne sont pas pris en compte lors des calculs. (voir aussi l'option <b><a href="#-mask">-mask</a></b>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-vecgrid"></a>-<b>vecgrid</b> <i>fichier</i></td>

<td>Permet de traiter des donn&eacute;es dont la grille est irr&eacute;guli&egrave;re.
Le fichier de grille contient les coordonn&eacute;es de chaque point du
fichier sp&eacute;cifi&eacute; par <b>-vecdata</b>. (voir aussi l'option
<b><a href="#-grid">-grid</a></b>)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP><a NAME="-veclim"></a>-<b>veclim</b> <i>fichier</i></td>

<td>Limites utilis&eacute;es pour la coloration des vecteurs. Voir la <a href="#Coloration des vecteurs">section
6.2</a> sur les couleurs, pour plus de d&eacute;tails sur le calcul des
limites.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>veclout</b> <i>fichier</i></td>

<td>Lorsque les limites sont calcul&eacute;es par <i>chart</i>, cette option
permet de les r&eacute;cup&eacute;rer dans un fichier. Attention, cette
option &eacute;crasera le fichier donn&eacute; en argument s'il existe
d&eacute;j&agrave;.&nbsp;</td>
</tr>
</table>

<h2>
&nbsp;&nbsp;&nbsp; <b>6.2&nbsp;<a NAME="Coloration des vecteurs"></a>Coloration
des vecteurs</b></h2>

<table BORDER=0 CELLSPACING=40 WIDTH="100%" >
<tr>
<td VALIGN=TOP WIDTH="30%">-<b>vecclrmod</b></td>

<td><i>Chart</i> colorera les vecteurs selon leur module</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>vecclr</b></td>

<td><i>Chart</i> colorera les vecteurs selon le champ de scalaires de <b><a href="#-clrdata">-clrdata</a></b>.
Les couleurs et les limites utilis&eacute;es seront celles du bloc de couleurs
et le trac&eacute; des couleurs sera d&eacute;sactiv&eacute;.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>vecmet</b> [<i>1</i> ou <i>2</i>]</td>

<td>Deux m&eacute;thodes de calcul des limites sont disponibles.&nbsp;
<blockquote>M&eacute;thode 1 : chart trouve les valeurs minimale et maximale
du champ de donn&eacute;es et divise la plage de valeurs par le nombre
de couleurs.(m&eacute;thode lin&eacute;aire)</blockquote>

<blockquote>M&eacute;thode 2 : <i>chart</i> proc&egrave;de par &eacute;galisation,
de fa&ccedil;on &agrave; attribuer une quantit&eacute; &eacute;gale de
points de grille &agrave; chaque couleur. (m&eacute;thode &eacute;galis&eacute;e)</blockquote>
Il est aussi possible de forcer les limites &agrave; certaines valeurs
au moyen d'un fichier. (voir l'option <b><a href="#-veclim">-vectlim</a></b>)&nbsp;</td>
</tr>

<tr>
<td>-<b>vecshade</b></td>

<td>Grise les parties "spval" sur un dessin de vecteur. En cas de grille
irr&eacute;guliere, cette option ne marche qu'avec l'option <a href="#-gridxy">-<b>gridxy</b></a>
(pas <a href="#-grid">-<b>grid</b></a>).</td>
</tr>
</table>

<h2>
&nbsp;&nbsp;&nbsp; 6.3 Texte d'information</h2>
<i>Note :&nbsp; La plupart des options suivantes ne sont, en fait, qu'un
acc&egrave;s direct &agrave; certaines constantes de NCAR graphics. Veuillez
vous r&eacute;f&eacute;rer au document &laquo; Vectors, a vector field
plotting utility &raquo; pp. 31 &agrave; 56 pour plus de d&eacute;tails.
Lorsqu'une option correspond directement &agrave; une constante NCAR, le
nom de la constante est indiqu&eacute;.</i>
<br>Deux blocs de texte sont affich&eacute;s par d&eacute;faut. Ils indiquent
la taille des vecteurs minimum et maximum, selon le format <font color="#000000">ci-dessous
:</font>
<center><img SRC="vecteurs.jpg" height=90 width=300></center>

<p>Les options suivantes permettent de modifier le contenu et la position
des textes. Notez que dans les noms d'options, <i>mn</i> r&eacute;f&egrave;re
au vecteur minimum et <i>mx </i>au vecteur maximum.
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=40 WIDTH="100%" >
<tr>
<td VALIGN=TOP WIDTH="40%">-<b>vecmns</b> <i>real</i>
<p>-<b>vecmxs</b> <i>real</i></td>

<td>Text Bloc Character Size (MNS et MXS).Taille des caract&egrave;res
utilis&eacute;s dans les blocs de texte.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>vecmnt</b> <i>string</i>
<p>-<b>vecmxt</b> <i>string</i></td>

<td>Vector Text String (character*36) (MNT et MXT). Cha&icirc;nes de caract&egrave;res
des blocs de texte. D&eacute;fauts : vecteur minimum et Vecteur maximum,
avec une fl&egrave;che sous les valeurs. (voir plus haut)&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>vecmnxy</b> <i>real real</i>
<p>-<b>vecmxxy</b> <i>real real</i></td>

<td>Coordonn&eacute;es des blocs de texte. (MNX, MNY, MXX et MXY). Voir
l'option -<b>vecmnp</b> pour savoir &agrave; quelle partie du texte correspondent
les coordonn&eacute;es.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>vecmnp</b> <i>integer</i>
<p>-<b>vecmxp</b> <i>integer</i></td>

<td>Vector Text Bloc Positioning (MNP et MXP).&nbsp;
<br>Indique quel point d'un bloc de texte est indiqu&eacute; par les coordonn&eacute;es
des options pr&eacute;c&eacute;dentes.&nbsp;
<br>&nbsp;
<p><img SRC="vecteurs2.jpg" height=120 width=180 align=LEFT></td>
</tr>
</table>

<br>&nbsp;
<h2>
6.4 Autres options</h2>
&nbsp;
<p>&nbsp;
<table BORDER=0 CELLSPACING=40 WIDTH="100%" >
<tr>
<td>-<b>veclev</b> <i>integer</i></td>

<td>Permet de sp&eacute;cifier les niveaux du fichier sp&eacute;cifi&eacute;
par <b><a href="#-vecdataxy">-vecdata </a></b>&agrave; tracer.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>vecvpo</b> <i>integer</i></td>

<td>Permet le choix de l'origine des fl&egrave;ches dans un dessin de vecteurs.
Les possibilit&eacute;s sont:&nbsp;
<p><i>integer</i> &lt; 0 : La t&ecirc;te du vecteur est au point de grille.&nbsp;
<p><i>integer </i>= 0 : Le centre du vecteur est au point de grille (d&eacute;faut)&nbsp;
<p><i>integer </i>> 0$ : La queue du vecteur est au point de grille.&nbsp;
<p>Cette option (surtout avec <i>integer</i> > 0) s'av&egrave;re int&eacute;ressante
pour visualiser un profil de vitesse.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>vecnotrace</b></td>

<td>Permet de d&eacute;finir des vecteurs avec <a href="#-vecdataxy">-<b>vecdataxy</b></a>
ou autre, sans les tracer. Utile si l'on utilise juste <a href="#-clrdatamod">-<b>clrdatamod</b>,</a>
qui passera le module des vecteurs en clrdata, et &eacute;vitera la superposition
des fl&egrave;ches par dessus.</td>
</tr>
</table>

<h1>
7.&nbsp;<a NAME="Texte"></a>Texte</h1>
Jusqu'&agrave; 10 cha&icirc;nes de caract&egrave;res peuvent &ecirc;tre
d&eacute;finies lors de l'appel de <i>chart</i>. Il est aussi possible,
&agrave; l'int&eacute;rieur de chaque cha&icirc;ne, d'utiliser des variables
qui seront remplac&eacute;es par des valeurs internes lors de la production
du dessin. On peut, par exemple, mettre dans un titre le num&eacute;ro
de la couche trac&eacute;e :
<p>&nbsp;"Num&eacute;ro de couche : @CLR_ICOU@"
<p>Lorsque le titre est ajout&eacute; au dessin, la variable CLR_ICOU est
remplac&eacute;e par le num&eacute;ro de la couche. Il est possible de
cr&eacute;er des cha&icirc;nes de caract&egrave;res dont le contenu d&eacute;pend
du fichier trait&eacute;.
<p>Il est aussi possible d'utiliser les caract&egrave;res de commande reconnus
par la fonction PLCHHQ de NCAR. Le caract&egrave;re de contr&ocirc;le est
| (pipe en UNIX). Par exemple, pour obtenir l'effet suivant :
<p>&nbsp;3.258x10<sup>-2</sup> m<sup>2</sup>s<sup>2</sup>
<p>On utiliserait la syntaxe suivante : "3.258x10|S|-2|N|m|S|2|N|s|S|2"
<p>Dans cet exemple, S est la commande plotchar Superscript et N est la
commande de retour &agrave; la normale. R&eacute;f&eacute;rez-vous au document
&laquo; Plotchar, a character-plotting package &raquo;, section 3.10 Functions
Codes, pages 13 &agrave; 18 pour plus de d&eacute;tails.
<br>&nbsp;
<h2>
7.1 Liste des variables</h2>
Voici la liste des variables auxquelles <i>chart</i> donne acc&egrave;s.
Le nom de chaque variable d&eacute;bute par un pr&eacute;fixe d&eacute;crivant
&agrave; quel fichier de donn&eacute;es elle se rapporte. Pour utiliser
ces variables dans une cha&icirc;ne de caract&egrave;res, mettez simplement
son nom entre @.
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 WIDTH="100%" >
<tr>
<td><i><font size=+1>Entiers</font></i></td>

<td>&nbsp;</td>

<td>&nbsp;</td>

<td>&nbsp;</td>
</tr>

<tr>
<td>COUCHE</td>

<td>&nbsp;</td>

<td>&nbsp;</td>

<td>num&eacute;ro de la couche</td>
</tr>

<tr>
<td>TSTEP</td>

<td>&nbsp;</td>

<td>&nbsp;</td>

<td>pas de temps</td>
</tr>

<tr>
<td>CLR_NX</td>

<td>CNT_NX</td>

<td>VEC_NX</td>

<td>nombre de points en X</td>
</tr>

<tr>
<td>CLR_NY</td>

<td>CNT_NY</td>

<td>&nbsp;VEC_NY</td>

<td>nombre de points en Y</td>
</tr>

<tr>
<td>CLR_NZ</td>

<td>CNT_NZ</td>

<td>VEC_NZ</td>

<td>nombre de couches</td>
</tr>

<tr>
<td>CLR_EXP</td>

<td>CNT_EXP</td>

<td>&nbsp;</td>

<td>exposant (puissance de 10)</td>
</tr>
</table>

<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 WIDTH="100%" >
<tr>
<td><i><font size=+1>R&eacute;els</font></i></td>

<td>&nbsp;</td>

<td>&nbsp;</td>

<td>&nbsp;</td>
</tr>

<tr>
<td>CLR_MIN</td>

<td>CNT_MIN</td>

<td>VEC_MIN</td>

<td>valeur minimale</td>
</tr>

<tr>
<td>CLR_MAX</td>

<td>CNT_MAX</td>

<td>VEC_MAX</td>

<td>valeur maximale</td>
</tr>

<tr>
<td>CLR_SPVAL</td>

<td>CNT_SPVAL</td>

<td>VEC_SPVAL</td>

<td>valeur sp&eacute;ciale</td>
</tr>

<tr>
<td>CLR_DX</td>

<td>CNT_DX</td>

<td>VEC_DX</td>

<td>degr&eacute;s/points de grille en X</td>
</tr>

<tr>
<td>CLR_DY</td>

<td>CNT_DY</td>

<td>VEC_DY</td>

<td>degr&eacute;s/points de grille en Y</td>
</tr>

<tr>
<td>CLR_TIME</td>

<td>CNT_TIME</td>

<td>VEC_TIME</td>

<td>champ H dans le BIMG</td>
</tr>

<tr>
<td>CLR_DEPTH</td>

<td>CNT_DEPTH</td>

<td>VEC_DEPTH</td>

<td>profondeur de la couche</td>
</tr>
</table>

<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 WIDTH="100%" >
<tr>
<td><i><font size=+1>Texte</font></i></td>

<td>&nbsp;</td>

<td>&nbsp;</td>

<td>&nbsp;</td>
</tr>

<tr>
<td>DATE</td>

<td>&nbsp;</td>

<td>&nbsp;</td>

<td>date de cr&eacute;ation du dessin</td>
</tr>

<tr>
<td>CLR_STR1</td>

<td>CNT_STR1</td>

<td>VEC_STR1</td>

<td>record 1, BIMG</td>
</tr>

<tr>
<td>CLR_STR2</td>

<td>CNT_STR2&nbsp;</td>

<td>VEC_STR2</td>

<td>record 2, BIMG</td>
</tr>

<tr>
<td>CLR_STR3</td>

<td>CNT_STR3</td>

<td>VEC_STR3</td>

<td>record 3, BIMG</td>
</tr>

<tr>
<td>CLR_STR4</td>

<td>CNT_STR4</td>

<td>VEC_STR4</td>

<td>record 4, BIMG</td>
</tr>

<tr>
<td>CLR_JCNES</td>

<td>CNT_JCNES</td>

<td>VEC_JCNES</td>

<td>traduit un jour CNES en texte</td>
</tr>
</table>

<h2>
7.2. Liste des options</h2>

<table BORDER=0 CELLSPACING=40 WIDTH="100%" >
<tr>
<td VALIGN=TOP><a NAME="-string"></a>-<b>string</b> <i>X Y S A string</i></td>

<td>Ajoute une cha&icirc;ne de caract&egrave;res au dessin. Les param&egrave;tres
sont :&nbsp;
<ul>
<li>
X, Y&nbsp;&nbsp;&nbsp;&nbsp; coordonn&eacute;es entre 0.0 et 1.0 sp&eacute;cifiant
la position du texte.&nbsp;</li>

<li>
S (size) taille des caract&egrave;res. (1.0 = taille normale)&nbsp;</li>

<li>
A (align) d&eacute;crit &agrave; quelle extr&eacute;mit&eacute; du texte
correspond la position (X, Y) :&nbsp;</li>

<br>-1: c&ocirc;t&eacute; gauche&nbsp;
<br>0&nbsp; : centre&nbsp;
<br>1&nbsp; : c&ocirc;t&eacute; droit&nbsp;</ul>

<ul>
<li>
string texte comportant au maximum 256 caract&egrave;res.&nbsp;</li>

<br>(attention, tenir compte de la taille des variables)&nbsp;</ul>
</td>
</tr>
</table>

<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=40 >
<tr>
<td VALIGN=TOP WIDTH="20%"><a NAME="-format"></a>-<b>format</b> <i>varfmt</i></td>

<td>Modifie le format d'une variable num&eacute;rique. Permet aussi de
contr&ocirc;ler le format de plusieurs &eacute;l&eacute;ments d'un dessin.
(voir liste ci-dessous).&nbsp;
<ul>
<li>
var : nom de la variable dont on d&eacute;sire modifier le format.&nbsp;</li>

<li>
fmt : format, de type fortran 77 standard. Les formats support&eacute;s
sont I, F et E.&nbsp;</li>
</ul>
Exemple, pour modifier le format des nombres apparaissant sous la barre
de palette :&nbsp;
<p>-<b>format</b> <i>PALETTE f5.2</i>
<p>En plus de pouvoir modifier le format de toutes les variables &eacute;num&eacute;r&eacute;es
plus haut, il est possible d'acc&eacute;der aux formats des champs suivants
:&nbsp;
<p>X_AXIS&nbsp; axe horizontal&nbsp;
<br>Y_AXIS&nbsp; axe vertical&nbsp;
<br>PALETTE barre de palette&nbsp;</td>
</tr>
</table>
<i>note : pour &eacute;liminer compl&egrave;tement la graduation sur un
des axes, utilisez -noxlab ou -noylab.</i>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=40 >
<tr>
<td VALIGN=TOP WIDTH="20%">-<b>font</b> <i>police</i></td>

<td>S&eacute;lectionne la police de caract&egrave;res qui sera utilis&eacute;e
pour tout le dessin. Consultez le document &laquo; Plotchar - a character
plotting package &raquo; page 22 pour la liste des polices disponibles.
Les polices donnant les meilleurs r&eacute;sultats &agrave; l'impression
sont :&nbsp;
<p>21 HELVETICA&nbsp;
<br>22 HELVETICA-BOLD&nbsp;
<br>23 TIMES-ROMAN&nbsp;
<br>24 TIMES-BOLD&nbsp;
<p>Il est &agrave; noter que la police peut &ecirc;tre chang&eacute;e &agrave;
l'int&eacute;rieur m&ecirc;me d'une cha&icirc;ne de caract&egrave;res,
avec la commande Fn o&ugrave; n est un num&eacute;ro de police. (les num&eacute;ros
sont donn&eacute;s dans la liste de la page 22 cit&eacute;e plus haut).
Par exemple, vous avez s&eacute;lectionn&eacute; la police HELVETICA et
vous d&eacute;sirez mettre un mot en bold dans une cha&icirc;ne de caract&egrave;res.&nbsp;
<p>A l'appel de <i>chart</i> :&nbsp;
<p>-<b>font</b> HELVETICA&nbsp;
<br>-<b>string</b> .2 .9 1. -1 "un |F22|mot |F21|en bold"&nbsp;
<p>donnera :&nbsp;
<p>un <b>mot</b> en bold&nbsp;</td>
</tr>
</table>

<h1>
8.&nbsp;<a NAME="Ajouts de surimpression"></a>Ajouts de lignes ou de caract&egrave;res
en surimpression</h1>
Il est possible de faire appara&icirc;tre des lignes ou des marqueurs en
surimpression au dessus de la carte.
<br>Pour &eacute;crire le nom d'un continent, pour positionner un mouillage,
ou pour d&eacute;finir une section hydrographique par exemple.
<br>&nbsp;
<table CELLSPACING=40 WIDTH="100%" >
<tr>
<td VALIGN=TOP>-<b>overdata</b> <i>fichier</i></td>

<td>Superpose &agrave; la carte des lignes polygonales d&eacute;crites
dans <i>fichier</i>. Le format est tr&egrave;s simple: c'est un fichier
ASCII, chaque ligne donnant la position d'un point en longitude latitude.
Si on d&eacute;sire plusieurs segments, il faut ins&eacute;rer entre les
segments, une ligne 9999 9999.</td>
</tr>

<tr>
<td>-<b>overlw</b></td>

<td>fixe l'&eacute;paisseur de trait pour les lignes superpos&eacute;es
(d&eacute;faut 1).</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>overmark</b>&nbsp; <i>fichier</i></td>

<td>Superpose &agrave; la carte des marqueurs dont la position est donn&eacute;e
dans fichier}. M&ecirc;me format de fichier que pour -overdata.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>overmk</b> <i>integer</i></td>

<td>sp&eacute;cifie le type de marqueur &agrave; utiliser selon la norme
GKS :&nbsp;
<br>&nbsp;1 = .&nbsp;
<br>&nbsp;2 = +&nbsp;
<br>&nbsp;3 = *&nbsp;
<br>&nbsp;4 = o&nbsp;
<br>&nbsp;5 = X&nbsp;
<br>Par d&eacute;faut le marqueur est 4 (petit cercle).</td>
</tr>

<tr>
<td>-<b>overmksc</b> <i>real</i></td>

<td>sp&eacute;cifie la taille du marqueur. Par d&eacute;faut, 1.</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>overclr</b> <i>integer</i></td>

<td>Donne l'index de couleur de la courbe en overlay, index 1 &eacute;tant
le premier de la palette visible (ie indice 20 du fichier palette).</td>
</tr>

<tr>
<td VALIGN=TOP>-<b>overmkclr</b> <i>integer</i></td>

<td>Donne l'index de couleur des marqueurs en overlay, index 1 &eacute;tant
le premier de la palette visible (ie indice 20 du fichier palette).</td>
</tr>
</table>

<h1>
9.&nbsp;<a NAME="Formats"></a>Formats des fichiers</h1>
Cette section d&eacute;crit les formats de tous les fichiers qui peuvent
&ecirc;tre donn&eacute;s en entr&eacute;e &agrave; <i>chart</i>. Plusieurs
formats ont chang&eacute; depuis la version 2.0, il est donc recommand&eacute;
de lire le texte &laquo; release notes &raquo; pour la mise &agrave; jour
des fichiers d&eacute;j&agrave; existants.
<br>&nbsp;
<h2>
9.1.&nbsp;<a NAME="Palette de couleurs"></a>Palette de couleurs</h2>
Un fichier de palette se divise en deux parties : les couleurs sp&eacute;ciales,
attribu&eacute;es &agrave; des &eacute;l&eacute;ments du dessin tels que
les continents ou les oc&eacute;ans, et les couleurs r&eacute;serv&eacute;es
aux donn&eacute;es, qui appara&icirc;tront dans la barre de palette.
<p>La d&eacute;finition d'une couleur comporte quatre &eacute;l&eacute;ments
: son index et les quantit&eacute;s de rouge, vert et bleu. L'index est
un nombre entre 0 et 99, alors que les autres valeurs doivent &ecirc;tre
situ&eacute;es entre 0.0 et 1.0. Par exemple, pour d&eacute;finir l'index
10 comme &eacute;tant du vert pur, on mettrait la ligne suivante dans le
fichier de palette :
<pre>&nbsp; 10 0.0 1.0 0.0</pre>
Les index 0 &agrave; 19 sont r&eacute;serv&eacute;s pour certains &eacute;l&eacute;ments
du dessin. Les index actuellement d&eacute;finis sont :
<blockquote>
<dl>
<dd>
0 : background</dd>

<dd>
1 : foreground</dd>

<dd>
2 : continents</dd>

<dd>
3 : valeur sp&eacute;ciale</dd>

<dd>
4 : oc&eacute;ans</dd>

<dd>
5 : isocontours</dd>

<dd>
6 : vecteurs</dd>

<dd>
7 : contours des continents</dd>
</dl>
</blockquote>
Les autres index sont r&eacute;serv&eacute;s pour des besoins futurs. Ils
peuvent &ecirc;tre utilis&eacute;s pour certaines options de <i>chart</i>,
par exemple:
<p>&nbsp; -<b>cntilb</b> Information Label Color
<br>&nbsp; -<b>cntlbc</b> Label Box Color
<p>Le reste des index, soit de 20 &agrave; 99, est utilis&eacute; pour
d&eacute;finir les couleurs attribu&eacute;es aux donn&eacute;es. Les index
doivent &ecirc;tre d&eacute;finis dans un ordre croissant, mais il n'est
pas n&eacute;cessaire de d&eacute;finir tous les index. <i>Chart</i> interpole
automatiquement les couleurs entre les index qui ne sont pas cons&eacute;cutifs.
Par exemple, pour obtenir un d&eacute;grad&eacute; de 10 couleurs variant
du noir au magenta:
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=15 >
<tr>
<td>
<pre>20</pre>
</td>

<td>
<pre>0.0</pre>
</td>

<td>
<pre>0.0</pre>
</td>

<td>
<pre>0.0</pre>
</td>
</tr>

<tr>
<td>
<pre>29</pre>
</td>

<td>
<pre>1.0</pre>
</td>

<td>
<pre>0.0</pre>
</td>

<td>
<pre>1.0</pre>
</td>
</tr>
</table>

<p>Finalement, il est possible d'ins&eacute;rer des lignes blanches entre
les index et d'ajouter des lignes de commentaires commen&ccedil;ant par
le caract&egrave;re #. Il est aussi &agrave; noter que tout ce qui se trouve
&agrave; droite d'une d&eacute;finition de couleur n'est pas pris en compte.
Un fichier de palette pourrait donc se lire comme suit :
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=15 >
<tr>
<td COLSPAN="5">
<pre># Palette pour les fichiers EKE&nbsp;</pre>
</td>
</tr>

<tr>
<td>
<pre>000</pre>
</td>

<td>
<pre>0.0</pre>
</td>

<td>
<pre>0.0</pre>
</td>

<td>
<pre>0.0</pre>
</td>

<td>
<pre>background</pre>
</td>
</tr>

<tr>
<td>
<pre>001</pre>
</td>

<td>
<pre>1.0</pre>
</td>

<td>
<pre>1.0</pre>
</td>

<td>
<pre>1.0</pre>
</td>

<td>
<pre>foreground</pre>
</td>
</tr>

<tr>
<td>
<pre>002</pre>
</td>

<td>
<pre>0.5</pre>
</td>

<td>
<pre>0.5</pre>
</td>

<td>
<pre>0.5</pre>
</td>

<td>
<pre>continents</pre>
</td>
</tr>

<tr>
<td>
<pre>005</pre>
</td>

<td>
<pre>1.0</pre>
</td>

<td>
<pre>0.0</pre>
</td>

<td>
<pre>0.0</pre>
</td>

<td>
<pre>isocontours</pre>
</td>
</tr>

<tr>
<td COLSPAN="5">
<pre># couleurs pour les donn&eacute;es</pre>
</td>
</tr>

<tr>
<td>
<pre>020</pre>
</td>

<td>
<pre>2.3</pre>
</td>

<td>
<pre>4.4</pre>
</td>

<td>
<pre>1.2</pre>
</td>

<td>&nbsp;</td>
</tr>

<tr>
<td>
<pre>021</pre>
</td>

<td>
<pre>4.2</pre>
</td>

<td>
<pre>2.2</pre>
</td>

<td>
<pre>5.8</pre>
</td>

<td>&nbsp;</td>
</tr>
</table>

<h2>
9.2.&nbsp;<a NAME="Fichier de configuration"></a>Fichier de configuration</h2>
Plut&ocirc;t que de toujours taper tous les arguments sur la ligne de commande,
il est possible de cr&eacute;er un fichier de configuration. La syntaxe
en est tr&egrave;s simple, elle est la m&ecirc;me que pour la ligne de
commande, la seule diff&eacute;rence &eacute;tant qu'il ne doit y avoir
qu'une seule option par ligne. Toutes les options peuvent &ecirc;tre utilis&eacute;es
dans un fichier de configuration, m&ecirc;me les options telles que -<b>clrdata</b>.
<p>L'option <b>-s</b> est utilis&eacute;e pour indiquer &agrave; <i>chart</i>
qu'il doit lire un fichier de configuration. D'autres options peuvent &ecirc;tre
utilis&eacute;es en m&ecirc;me temps que <b>-s</b> sur la ligne de commande.
Les options sont lues de droite &agrave; gauche, et les derni&egrave;res
options lues ont priorit&eacute;. Par exemple, on peut cr&eacute;er un
fichier de configuration qui affiche les trois premiers records d'un fichiers
BIMG. Soit le fichier entete.conf :
<dl>
<pre>-string 0.05 0.94 1-1 "@CLR_STR1@"&nbsp;
-string 0.05 0.90 1-1 "@CLR_STR2@"&nbsp;
-string 0.05 0.86 1-1 "@CLR_STR3@"</pre>
</dl>
On pourrait ensuite utiliser ce fichier lors de l'appel de <i>chart</i>,
de la fa&ccedil;on suivante :
<pre>&nbsp; chart -s entete.conf -clrdata topex.bimg -zoom -82 -62 35 45</pre>
Comme dans le cas d'une palette, les lignes blanches et les lignes de commentaires
commen&ccedil;ant par # sont accept&eacute;es. Par contre, il ne faut rien
mettre &agrave; la fin d'une ligne d'option. Voici un exemple de fichier
de configuration qui ajoute la bathym&eacute;trie et un titre, ainsi que
le type d'unit&eacute;s &agrave; un trac&eacute; d'isocontours. (appelons
le bathy.set)
<pre># fichier de configuration</pre>

<pre>-clrdata bathy.bimg&nbsp;
-p psi.2.pal&nbsp;
-string 0.05 0.90 2 -1 "Isocontours sur fond de bathymetrie"&nbsp;
-string 0.95 0.06 0.6 1 "Unites : m|S|2|N|s|S|-1| x10|S|@CNT_EXP@"</pre>
Ce fichier pourrait &ecirc;tre utilis&eacute; dans une commande telle que
:
<pre>&nbsp; chart -cntdata topex.bimg -cntexp 4 -s bathy.set</pre>

<h2>
9.3.&nbsp;<a NAME="Format bimg"></a>Format BIMG</h2>
Un fichier BIMG est compos&eacute; de deux parties principales : une ent&ecirc;te
d&eacute;crivant le contenu du fichier et les donn&eacute;es d&eacute;crites.
Une doc de Jean-Marc Molines est disponible si vous d&eacute;sirez une
description plus d&eacute;taill&eacute;e du format.
<p>Les 6 premiers records forment l'ent&ecirc;te.
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=15 >
<tr>
<td WIDTH="150">Records 1 &agrave; 4:</td>

<td>character*80</td>
</tr>

<tr>
<td>&nbsp;</td>

<td>Quatre cha&icirc;nes de caract&egrave;res pouvant servir &agrave; d&eacute;crire
le fichier.&nbsp;</td>
</tr>
</table>

<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=15 >
<tr>
<td WIDTH="150">Record 5:</td>

<td>integer (6)&nbsp;</td>
</tr>

<tr>
<td>&nbsp;</td>

<td>NX : nombre de points en X&nbsp;
<br>NY : nombre de points en Y&nbsp;
<br>NZ : nombre de couches&nbsp;
<br>NT : nombre de pas de temps&nbsp;
<br>NDIM : nombre de dimensions par couche (1-3)&nbsp;
<br>ICOD : code identifiant le type de donn&eacute;es. Utilis&eacute; pour
les configurations par d&eacute;faut. (voir <font color="#FF0000">section
10</font>)&nbsp;</td>
</tr>
</table>

<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=15 >
<tr>
<td WIDTH="150">Record 6 :</td>

<td>real (5)</td>
</tr>

<tr>
<td>&nbsp;</td>

<td>X1 : longitude du coin inf&eacute;rieur gauche&nbsp;
<br>Y1 : latitude du coin inf&eacute;rieur gauche&nbsp;
<br>DX : nombre de degr&eacute;s par point de grille (longitude)&nbsp;
<br>DY : nombre de degr&eacute;s par point de grille (latitude)&nbsp;
<br>SPVAL : valeur sp&eacute;ciale&nbsp;</td>
</tr>
</table>

<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=15 >
<tr>
<td WIDTH="150">Record 7 :</td>

<td>real (NZ)&nbsp;</td>
</tr>

<tr>
<td>&nbsp;</td>

<td>P(NZ) : tableau contenant la profondeur de chaque couche.&nbsp;</td>
</tr>
</table>
Par la suite, le nombre de records d&eacute;pend de NZ, NT et NDIM.
<p>Voici un exemple de code FORTRAN pour cr&eacute;er un fichier BIMG.
Le fichier contiendra 4 couches de 2 dimensions, la r&eacute;solution est
de un sixi&egrave;me de degr&eacute; et la zone couverte s'&eacute;tend
de -82&deg;E &agrave; -2&deg;E et de 20&deg;N &agrave; 60&deg;N.
<dl>
<pre>implicit none&nbsp;
integer nxx, nyy, na&nbsp;
parameter (nxx=700, nyy=400, na=20)</pre>

<pre>integer k, i, j, t&nbsp;
integer couche</pre>

<pre>real vitesse_x(nxx, nyy, na)&nbsp;
real vitesse_y(nxx, nyy, na)&nbsp;
real prof(na)</pre>

<pre>character*80 record_str&nbsp;
integer nx, ny, nz, day, icod, ndim&nbsp;
real lonmin, latmin, dx, dy, spval</pre>

<pre>nx = 480&nbsp;
ny = 280&nbsp;
nz = 4&nbsp;
nt = 1&nbsp;
ndim = 2&nbsp;
icod = 1</pre>

<pre>lonmin = -82.0&nbsp;
latmin = 20.0&nbsp;
dx&nbsp; = 1.0/6.0&nbsp;
dy&nbsp; = 1.0/6.0&nbsp;
spval&nbsp; = 999999</pre>

<pre>prof(1) = 100.0&nbsp;
prof(2) = 300.0&nbsp;
prof(3) = 450.0&nbsp;
prof(4) = 4000.0</pre>

<pre>open(100, file=fileout, form='unformatted')</pre>

<pre>record_str = ?commentaire ligne 1'&nbsp;
write(100) record_str&nbsp;
record_str = ?commentaire ligne 2'&nbsp;
write(100) record_str&nbsp;
record_str = ?commentaire ligne 3'&nbsp;
write(100) record_str&nbsp;
record_str = ?commentaire ligne 4'&nbsp;
write(100) record_str</pre>

<pre>write(100) nx, ny, nz, nt, ndim, icod</pre>

<pre>write(100) lonmin, latmin, dx, dy, spval</pre>

<pre>write(100) (prof(couche), couche=1, nz)</pre>

<pre>do t=1, nt&nbsp;
write(100) t&nbsp;
do couche=1, nz&nbsp;
write(100) ((vitesse_x(i, j, couche), i=1, nx), j=1, ny)&nbsp;
write(100) ((vitesse_x(i, j, couche), i=1, nx), j=1, ny)&nbsp;
enddo&nbsp;
enddo</pre>

<pre>close(100)</pre>
</dl>
Vous pouvez ensuite utiliser la commande <b>bimgchk</b> pour v&eacute;rifier
l'ent&ecirc;te du fichier que vous venez de cr&eacute;er.
<h2>
9.4. Grille irr&eacute;guli&egrave;re</h2>
Une grille irr&eacute;guli&egrave;re est d&eacute;finie au moyen d'un fichier
BIMG comportant deux couches. La couche 1 contient la coordonn&eacute;e
en X de chaque point et la couche 2 la coordonn&eacute;e en Y. Il y a tr&egrave;s
peu de champs &agrave; remplir pour cr&eacute;er un fichier grille, il
faut seulement d&eacute;finir NX, NY et NZ (NZ &eacute;tant 2).
<p>Pour &ecirc;tre compatible avec un fichier de donn&eacute;es, un fichier
grille doit contenir le m&ecirc;me nombre de points en X et Y.
<p><i><font color="#FF0000">Note : actuellement, le type de grille support&eacute;
est une grille semi-irr&eacute;guli&egrave;re, c'est-&agrave;-dire que
dx ne d&eacute;pend que de i et dy ne d&eacute;pend que de j. (voir la
figure ci-dessous)</font></i>
<p><font color="#FF0000">Pour plus de d&eacute;tails sur ce type de grille,
r&eacute;f&eacute;rez-vous au document &laquo; Contouring and Mapping Tutorial
&raquo;, Cp 3.4 Irregularly Spaced Data, page 226.</font>
<h2>
9.5.&nbsp;<a NAME="Masque"></a>Masque</h2>
Un fichier masque est utile lorsqu'on d&eacute;sire qu'une r&eacute;gion
soit ignor&eacute;e par <i>chart</i>, sans avoir &agrave; remplacer cette
r&eacute;gion par <i>spval</i> dans le fichier. Un fichier masque est un
fichier BIMG ne comportant qu'une seule couche. Pour &ecirc;tre compatible
avec un fichier de donn&eacute;es, un fichier masque doit contenir le m&ecirc;me
nombre de points en X et Y.
<p>Un fichier masque contient la valeur 0 ou 1 &agrave; chaque point de
grille. Lors de la lecture d'un fichier BIMG auquel a &eacute;t&eacute;
rattach&eacute; un fichier masque, chaque point o&ugrave; le masque contient
1 sera remplac&eacute; par <i>spval</i>. La valeur sp&eacute;ciale utilis&eacute;e
est celle du fichier de donn&eacute;es, les seuls champs utilis&eacute;s
dans le fichier masque dont NX, NY et NZ et le record contenant les donn&eacute;es.
(NZ valant 1)
<br>Notez bien qu'il faut quand m&ecirc;me remplir les autres champs par
des valeurs bidon lors de la cr&eacute;ation du masque.
<br>&nbsp;
<br>&nbsp;
<h1>
10.&nbsp;<a NAME="Variables"></a>Variables d'environnement</h1>
Lorsque vous aurez acquis une certaine exp&eacute;rience de <i>chart</i>,
vous aurez sans doute cr&eacute;&eacute; plusieurs fichiers de palettes,
de limites et de configuration. Pour &eacute;viter d'avoir des fichiers
dispers&eacute;s dans tous les recoins de vos r&eacute;pertoires, il vous
est fortement recommand&eacute; de les regrouper dans des r&eacute;pertoires
d&eacute;di&eacute;s.
<p>Par exemple, vous pourriez cr&eacute;er trois r&eacute;pertoires, /PALETTE,
/LIMITE et /CONFIG. Une fois cette &eacute;tape r&eacute;alis&eacute;e
et tous les fichiers transf&eacute;r&eacute;s dans les r&eacute;pertoires
appropri&eacute;s, vous n'aurez plus qu'&agrave; d&eacute;finir quelques
variables d'environnement dans votre fichier .cshrc pour indiquer &agrave;
<i>chart</i>
o&ugrave; se trouvent vos r&eacute;pertoires.
<p>Six variables d'environnement peuvent &ecirc;tre d&eacute;finies.
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 CELLSPACING=40 >
<tr>
<td VALIGN=TOP>NCAR_ROOT:</td>

<td>Chart est construit sur la librairie NCAR et requiert que cette variable
d'environnement soit d&eacute;finie. Sur la plupart des machines, le r&eacute;pertoire
NCAR est le suivant:&nbsp; /usr/local/NCARG3.2&nbsp;</td>
</tr>

<tr>
<td>BIMG_PALDIR:</td>

<td>Indique le r&eacute;pertoire dans lequel se trouvent vos palettes.&nbsp;</td>
</tr>

<tr>
<td>BIMG_LIMDIR:</td>

<td>Indique le r&eacute;pertoire dans lequel se trouvent vos fichiers de
limites.&nbsp;</td>
</tr>

<tr>
<td>BIMG_DATDIR:</td>

<td>Indique le r&eacute;pertoire dans lequel se trouvent vos fichiers de
donn&eacute;es.&nbsp;</td>
</tr>

<tr>
<td>BIMG_STSDIR :</td>

<td>Indique le r&eacute;pertoire dans lequel se trouvent vos fichiers de
configuration.&nbsp;</td>
</tr>

<tr>
<td VALIGN=TOP>BIMG_ROOT :</td>

<td>Plusieurs palettes et configurations par d&eacute;faut existent d&eacute;j&agrave;
et sont utilis&eacute;es par plusieurs personnes. Ce r&eacute;pertoire
contient les configurations, palettes et limites communes &agrave; plusieurs
personnes et &eacute;vite d'avoir plusieurs copies des fichiers. Il contient
l'aborescence suivante :&nbsp;
<table BORDER=0 CELLSPACING=40 >
<tr>
<td>BIMG_ROOT&nbsp;</td>

<td>/pal&nbsp;
<p>/lim&nbsp;
<p>/dat&nbsp;
<p>/sts&nbsp;</td>
</tr>
</table>
&nbsp;</td>
</tr>
</table>
Lorsque vous donnez un fichier en argument &agrave; <i>chart</i>, il le
cherchera d'abord dans le r&eacute;pertoire courant, puis dans l'un de
vos r&eacute;pertoires personnels, et finalement dans le r&eacute;pertoire
syst&egrave;me (BIMG_ROOT).
<p>Par exemple, si toutes vos palettes se trouvent dans le r&eacute;pertoire
/sgi2/brown/bimg/PALETTE, vous devriez ajouter la ligne suivante &agrave;
votre fichier .<i>cshrc</i> :
<pre>&nbsp;setenv BIMG_PALDIR /sgi2/brown/bimg/PALETTE</pre>
Puis, au lieu de taper la ligne de commande suivante :
<pre>&nbsp;chart -p /sgi2/brown/bimg/PALETTE/psi.pal -clrdata topex.bimg</pre>
Vous n'aurez plus qu'&agrave; taper :
<pre>&nbsp;chart -p psi.pal -clrdata topex.bimg</pre>
Si un fichier psi.pal existe dans le r&eacute;pertoire courant, il sera
lu. Sinon, il sera recherch&eacute; dans $BIMG_PALDIR.
<br>&nbsp;
<br>&nbsp;
</body>
</html>
