<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Anne de Miranda">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.05 [en] (Win95; I) [Netscape]">
   <TITLE>introduction</TITLE>
</HEAD>
<BODY>

<H1>
<A NAME="Introduction"></A>Introduction</H1>
Chart est un outil graphique de visualisation de donn&eacute;es au format
BIMG bas&eacute; sur la librairie de fonctions NCAR Graphics. Il permet
de repr&eacute;senter l’information sous forme de dessin couleur, d’isocontours
et/ou de vecteurs et poss&egrave;de quelques options de texte. Il supporte
aussi la plupart des projections de NCAR Graphics et peut superposer une
carte g&eacute;ographique aux donn&eacute;es.

<P>Chart est divis&eacute; en plusieurs blocs, ind&eacute;pendants les
uns des autres et poss&eacute;dant chacun leur entr&eacute;e de donn&eacute;es.
Actuellement, il existe trois blocs qui traitent les couleurs, les isocontours
et les vecteurs. Il existe aussi deux autres blocs qui s’occupent de la
carte et du texte. Il est &agrave; noter que la configuration de la carte
influence tous les blocs, &eacute;tant donn&eacute; que la projection choisie
d&eacute;terminera le trac&eacute; des donn&eacute;es. Chaque bloc produit
une partie de dessin qui sera assembl&eacute;e aux autres pour cr&eacute;er
le dessin final. La figure suivante illustre l’architecture de chart.

<P>Chaque entr&eacute;e peut accepter un fichier de donn&eacute;es, un
fichier masque et un fichier grille. Comme chaque bloc est ind&eacute;pendant,
des donn&eacute;es de masque et de grilles diff&eacute;rentes peuvent &ecirc;tre
sp&eacute;cifi&eacute;es &agrave; chaque entr&eacute;e. Les seules restrictions
sont qu’une zone commune doit &ecirc;tre couverte par l’ensemble des fichiers
de donn&eacute;es et que les fichiers de grille et de masque doivent avoir
la m&ecirc;me taille que les fichiers de donn&eacute;es auxquels ils s’appliquent.
R&eacute;f&eacute;rez-vous &agrave; la section 8 pour plus de d&eacute;tails
sur le format des fichiers.

<P>Les fichiers de donn&eacute;es et les options sont fournis sur la ligne
de commande lors de l’appel de chart, ou peuvent se trouver dans un fichier
de configuration. Les options relatives aux couleurs d&eacute;butent toutes
par clr, aux contours par cnt et aux vecteurs par vec. Par exemple, pour
un trac&eacute; couleur des donn&eacute;es du fichier topex.bimg, on taperait
la ligne de commande suivante :
<BR>&nbsp; <I><B>chart</B> -<B>clrdata</B> topex.bimg</I>

<P>Pour tracer uniquement la r&eacute;gion situ&eacute;e entre -82&deg;E
et -62&deg;E de longitude et 20&deg;N et 40&deg;N de latitude, avec la
bathym&eacute;trie en couleur et les isocontours de topex.bimg, on taperait
la ligne de commande suivante :
<BR>&nbsp; <I><B>chart -clrdata</B> bathy.bimg <B>-cntdata</B> topex.bimg
<B>-zoom</B> -82 -62 20 40</I>

<P>Cet exemple illustre la division de chart en blocs :

<P>Voici un bref aper&ccedil;u des diff&eacute;rentes possibilit&eacute;s
de chart :
<BLOCKQUOTE><B>Couleur</B> : par d&eacute;faut, chart utilise une palette
de couleur interne, qui d&eacute;finit la couleur des mers, des continents,
etc. Il est possible de d&eacute;finir sa propre palette et de la fournir
&agrave; chart. Voir la section 4 &agrave; ce sujet.
<BR>Pour colorer les donn&eacute;es, chart calcule des limites qui serviront
&agrave; d&eacute;terminer la couleur de chaque point selon sa valeur.
Il existe deux m&eacute;thodes de calcul des limites (lin&eacute;aire et
&eacute;galis&eacute;e) et il est aussi possible d’imposer les limites
&agrave; l’aide d’un fichier. (voir section 4)</BLOCKQUOTE>

<BLOCKQUOTE><B>Isocontours</B> : Des isocontours sont automatiquement trac&eacute;s
d&egrave;s que des donn&eacute;es sont fournies au bloc. Il est possible
de choisir le nombre d’isocontours trac&eacute;s, l’intervalle qui les
s&eacute;pare, ainsi que leur valeur. Plusieurs autres options sont disponibles
pour modifier les line labels ainsi que le texte d’information. (voir section
5)</BLOCKQUOTE>

<BLOCKQUOTE><B>Vecteurs</B> : Chart produit un trac&eacute; de vecteurs
d&egrave;s que des donn&eacute;es vectorielles sont fournies. Il est possible
de sous-&eacute;chantilloner un champ. Plusieurs autres options permettent
de modifier l’apparence des vecteurs (longueur, couleur). Les vecteurs
peuvent &ecirc;tre color&eacute;s selon leur module, ou selon le champ
de donn&eacute;es du bloc couleur. (voir section 6)</BLOCKQUOTE>

<BLOCKQUOTE><B>Cartes</B> : Chart trace automatiquement une carte sur les
donn&eacute;es. Il est possible de ne pas tracer les continents, ou de
ne tracer que leur contour. Plusieurs types de projection sont possibles.
D’autres options permettent de contr&ocirc;ler le trac&eacute; des m&eacute;ridiens,
de ne tracer qu’une partie des donn&eacute;es, etc. (voir section 3)</BLOCKQUOTE>

<BLOCKQUOTE><B>Texte</B> : 10 cha&icirc;nes de caract&egrave;res peuvent
&ecirc;tre ajout&eacute;es au dessin. Il est possible de s&eacute;lectionner
la taille des caract&egrave;res ainsi que leur police. Chart suppose aussi
la plupart des options de PLOTCHAR (module de NCAR Graphics).</BLOCKQUOTE>
&nbsp;
<BR>&nbsp;
</BODY>
</HTML>
