<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Anne de Miranda">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.05 [en] (Win95; I) [Netscape]">
   <TITLE>isocontours</TITLE>
</HEAD>
<BODY TEXT="#993300" BGCOLOR="#FFFFCC" LINK="#000066" VLINK="#551A8B" ALINK="#3366FF">
&nbsp;
<CENTER>
<H1>
<A NAME="Isocontours"></A>Isocontours</H1></CENTER>
Toutes les options se rapportant aux isocontours commencent par le pr&eacute;fixe
cnt. Pour ceux qui connaissent d&eacute;j&agrave; chart, le nom des anciennes
options correspondantes est indiqu&eacute; &agrave; la section 10 et peut
toujours &ecirc;tre employ&eacute;, mais il est recommand&eacute; d置tiliser
la nouvelle syntaxe.

<P>Par d&eacute;faut chart dessine automatiquement des isocontours d&egrave;s
que les donn&eacute;es sont entr&eacute;es avec -cntdata. Le nombre d段socontours
et leurs valeurs sont choisis par NCAR pour donner un beau r&eacute;sultat
(nice value). Il est possible, avec les options d&eacute;crites dans cette
section, de modifier ces valeurs par d&eacute;faut pour obtenir exactement
les isocontours d&eacute;sir&eacute;s.
<BR>&nbsp;
<TABLE BORDER WIDTH="100%" >
<CAPTION><A NAME="cntfichiers"></A><B>Fichiers</B></CAPTION>

<TR>
<TD>-<B>cntdata</B> fichier</TD>

<TD>sp&eacute;cifie le fichier de donn&eacute;es</TD>
</TR>

<TR>
<TD>-<B><A HREF="#cntmask">cntmask</A></B> fichier</TD>

<TD>fichier de mask</TD>
</TR>

<TR>
<TD>-<B><A HREF="#cntgrid">cntgrid</A></B> fichier</TD>

<TD>nom du fichier grille si les donn&eacute;es sont irr&eacute;guli&egrave;res</TD>
</TR>

<TR>
<TD>-<B><A HREF="#cntlim">cntlim</A></B> fichier</TD>

<TD>nom du fichier qui contient les valeurs exactes des isocontours</TD>
</TR>

<TR>
<TD>-<B><A HREF="#cntlout">cntlout</A></B> fichier</TD>

<TD>nom de sorties des isocontours calcul&eacute;s par chart</TD>
</TR>
</TABLE>
&nbsp;
<TABLE BORDER WIDTH="100%" >
<CAPTION><A NAME="Modification"></A><B>Modification des isocontours</B></CAPTION>

<TR>
<TD>-<B><A HREF="#cntnum">cntnum</A></B> integer</TD>

<TD>nombre d'isocontours</TD>
</TR>

<TR>
<TD>-<B><A HREF="#cntint">cntint</A></B> real</TD>

<TD>intervalle entre les isocontours</TD>
</TR>

<TR>
<TD>-<B>cntmin</B> real</TD>

<TD>valeur minimale &agrave; consid&eacute;rer lors des calculs d'isocontours</TD>
</TR>

<TR>
<TD>-<B>cntmax</B> real</TD>

<TD>valeur maximale &agrave; consid&eacute;rer lors des calculs d'isocontours</TD>
</TR>
</TABLE>
&nbsp;
<TABLE BORDER WIDTH="100%" >
<CAPTION><A NAME="Line labels"></A><B>Line Labels... si c'est du charrabia,
c'est &agrave; cause de NCAR Graphics !</B></CAPTION>

<TR>
<TD>-<B><A HREF="#cntlbc">cntlbc</A></B> integer</TD>

<TD>Label Box Color index (LBC)</TD>
</TR>

<TR>
<TD>-<B><A HREF="#cntllb">cntllb</A></B> integer</TD>

<TD>Line Label Box flag (LLB)</TD>
</TR>

<TR>
<TD>-<B><A HREF="#cntllp">cntllp</A></B> integer</TD>

<TD>Line Label Positioning (LLP)</TD>
</TR>

<TR>
<TD>-<B><A HREF="#cntlw">cntlw</A></B> real</TD>

<TD>Largeur du trait des isocontours</TD>
</TR>

<TR>
<TD>-<B><A HREF="#cntlabc">cntlabc</A></B> <I>integer</I></TD>

<TD>D&eacute;termine l段ndex de couleur du texte des line labels</TD>
</TR>
</TABLE>
&nbsp;

<P>-<A NAME="cntmask"></A><B>cntmask</B> <I>fichier</I>
<BR>Permet de masquer une partie des donn&eacute;es. Les points de grille
masqu&eacute;s sont remplac&eacute;s par une valeur sp&eacute;ciale et
ne sont pas pris en compte lors des calculs. (voir aussi l弛ption -<B><A HREF="general.html#-mask">mask</A></B>)
<BR><A HREF="#cntfichiers">retour</A>

<P>-<A NAME="cntgrid"></A><B>cntgrid</B> <I>fichier</I>
<BR>Permet de traiter des donn&eacute;es dont la grille est irr&eacute;guli&egrave;re.
Le fichier de grille contient les coordonn&eacute;es de chaque point du
fichier sp&eacute;cifi&eacute; par -<B>cntdata</B>. (voir aussi l弛ption
-<B><A HREF="general.html#-grid">grid</A></B>)

<P>-<A NAME="cntlim"></A><B>cntlim</B> fichier
<BR>La valeur exacte de chaque isocontour est lue dans ce fichier. Le nombre
d段socontours d&eacute;pend du nombre de valeurs de ce fichier.

<P>-<A NAME="cntlout"></A><B>cntlout</B> fichier
<BR>Lorsque les isocontours sont calcul&eacute;s par chart, cette option
permet de les r&eacute;cup&eacute;rer dans un fichier. Attention, cette
option &eacute;crasera le fichier donn&eacute; en argument s段l existe
d&eacute;j&agrave;.
<BR>
<HR WIDTH="100%">
<BR>-<A NAME="cntnum"></A><B>cntnum</B> <I>integer</I>
<BR>D&eacute;termine le nombre d段socontours. NCAR calculera l段ntervalle
n&eacute;cessaires pour obtenir N isocontours entre les valeurs maximale
et minimale contenue dans les donn&eacute;es.

<P>-<A NAME="cntint"></A><B>cntint</B> <I>real</I>
<BR>D&eacute;termine l段ntervalle entre les isocontours. Les isocontours
seront trac&eacute;s &agrave; partir de la valeur minimale toruv&eacute;e
dans les donn&eacute;es.

<P>
<HR WIDTH="100%">

<P>Note : La plupart des options suivantes ne sont, en fait, qu置n acc&egrave;s
direct &agrave; certaines constantes de NCAR Graphics. Veuillez vous r&eacute;f&eacute;rez
au document &laquo;contouring adn Mapping Tutorial &raquo; pp. 393 &agrave;
416 pour plus de d&eacute;tails. Lorsqu置ne option correspond directement
&agrave; une constante NCAR, le nom de la constante est indiqu&eacute;e.

<P>-<A NAME="cntlbc"></A><B>cntlbc</B> <I>integer</I>
<BR>Label Box Color index (LBC).
<BR>&nbsp;D&eacute;termine l段ndex de couleur des bo&icirc;tes entourant
les line labels.

<P>-<A NAME="cntllb"></A><B>cntllb</B> <I>integer</I>
<BR>Line Label Box flag (LLB). Valide pour LLB &eacute;gal &agrave; 2 ou
3.
<BR>&nbsp;D&eacute;termine le type de cadre autour des line labels.
<BR>&nbsp;0 - aucun cadre
<BR>&nbsp;1 - seul un p&eacute;rim&egrave;tre est dessin&eacute; autour
des labels. (m&ecirc;me couleur que le texte)
<BR>&nbsp;2 - une bo&icirc;te de couleur (index LBC) est dessin&eacute;e
autour des labels.
<BR>&nbsp;3 - 1 et 2, soit une bo&icirc;te de couleur avec un cadre.

<P>-<A NAME="cntllp"></A><B>cntllp</B> <I>integer</I>
<BR>Line Label Positioning (LLP).
<BR>&nbsp;D&eacute;termine si oui ou non des line labels seront dessin&eacute;s
et de auel type. 0=aucun label, 2= d&eacute;faut
<BR>&nbsp;(voir page 406 du document &laquo; Contouring and Mapping Tutorial
&raquo; pour plus de d&eacute;tails).

<P>-<A NAME="cntlw"></A><B>cntlw</B> <I>real</I>
<BR>Largeur du trait des isocontours. Deux points, suivis d置ne valeur,
indiquent la largeur du trait des isocontours &eacute;tiquet&eacute;s (voir
l弾xemple ci-dessous). D&eacute;faut 1.

<P>-<A NAME="cntlabc"></A><B>cntlabc</B> <I>integer</I>
<BR>D&eacute;termine l段ndex de couleur du texte des line labels. (une
couleur sp&eacute;ciale dont l段ndex est entre 10 et 19 peut &ecirc;tre
utilis&eacute;e, voir section 8.1)

<P>Exemple obtenu avec les options : -cntlbc 21 - cntllb 3 -cntlabw 1:3
<BR>&nbsp;
</BODY>
</HTML>
